[
  {
    "id": "ac-1",
    "label": "AC-01",
    "title": "Policy and Procedures",
    "text": "Policy and Procedures\nDevelop, document, and disseminate to {{ insert: param, ac-1_prm_1 }}:\nDesignate an {{ insert: param, ac-01_odp.04 }} to manage the development, documentation, and dissemination of the access control policy and procedures; and\nReview and update the current access control:\nAccess control policy and procedures address the controls in the AC family that are implemented within systems and organizations. The risk management strategy is an important factor in establishing such policies and procedures. Policies and procedures contribute to security and privacy assurance. Therefore, it is important that security and privacy programs collaborate on the development of access control policy and procedures. Security and privacy program policies and procedures at the organization level are preferable, in general, and may obviate the need for mission- or system-specific policies and procedures. The policy can be included as part of the general security and privacy policy or be represented by multiple policies reflecting the complex nature of organizations. Procedures can be established for security and privacy programs, for mission or business processes, and for systems, if needed. Procedures describe how the policies or controls are implemented and can be directed at the individual or role that is the object of the procedure. Procedures can be documented in system security and privacy plans or in one or more separate documents. Events that may precipitate an update to access control policy and procedures include assessment or audit findings, security incidents or breaches, or changes in laws, executive orders, directives, regulations, policies, standards, and guidelines. Simply restating controls does not constitute an organizational policy or procedure.",
    "group": "Access Control",
    "parent_id": "ac",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ac-2",
    "label": "AC-02",
    "title": "Account Management",
    "text": "Account Management\nDefine and document the types of accounts allowed and specifically prohibited for use within the system;\nAssign account managers;\nRequire {{ insert: param, ac-02_odp.01 }} for group and role membership;\nSpecify:\nRequire approvals by {{ insert: param, ac-02_odp.03 }} for requests to create accounts;\nCreate, enable, modify, disable, and remove accounts in accordance with {{ insert: param, ac-02_odp.04 }};\nMonitor the use of accounts;\nNotify account managers and {{ insert: param, ac-02_odp.05 }} within:\nAuthorize access to the system based on:\nReview accounts for compliance with account management requirements {{ insert: param, ac-02_odp.10 }};\nEstablish and implement a process for changing shared or group account authenticators (if deployed) when individuals are removed from the group; and\nAlign account management processes with personnel termination and transfer processes.\nExamples of system account types include individual, shared, group, system, guest, anonymous, emergency, developer, temporary, and service. Identification of authorized system users and the specification of access privileges reflect the requirements in other controls in the security plan. Users requiring administrative privileges on system accounts receive additional scrutiny by organizational personnel responsible for approving such accounts and privileged access, including system owner, mission or business owner, senior agency information security officer, or senior agency official for privacy. Types of accounts that organizations may wish to prohibit due to increased risk include shared, group, emergency, anonymous, temporary, and guest accounts.\n\nWhere access involves personally identifiable information, security programs collaborate with the senior agency official for privacy to establish the specific conditions for group and role membership; specify authorized users, group and role membership, and access authorizations for each account; and create, adjust, or remove system accounts in accordance with organizational policies. Policies can include such information as account expiration dates or other factors that trigger the disabling of accounts. Organizations may choose to define access privileges or other attributes by account, type of account, or a combination of the two. Examples of other attributes required for authorizing access include restrictions on time of day, day of week, and point of origin. In defining other system account attributes, organizations consider system-related requirements and mission/business requirements. Failure to consider these factors could affect system availability.\n\nTemporary and emergency accounts are intended for short-term use. Organizations establish temporary accounts as part of normal account activation procedures when there is a need for short-term accounts without the demand for immediacy in account activation. Organizations establish emergency accounts in response to crisis situations and with the need for rapid account activation. Therefore, emergency account activation may bypass normal account authorization processes. Emergency and temporary accounts are not to be confused with infrequently used accounts, including local logon accounts used for special tasks or when network resources are unavailable (may also be known as accounts of last resort). Such accounts remain available and are not subject to automatic disabling or removal dates. Conditions for disabling or deactivating accounts include when shared/group, emergency, or temporary accounts are no longer required and when individuals are transferred or terminated. Changing shared/group authenticators when members leave the group is intended to ensure that former group members do not retain access to the shared or group account. Some types of system accounts may require specialized training.",
    "group": "Access Control",
    "parent_id": "ac",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ac-3",
    "label": "AC-03",
    "title": "Access Enforcement",
    "text": "Access Enforcement\nEnforce approved authorizations for logical access to information and system resources in accordance with applicable access control policies.\nAccess control policies control access between active entities or subjects (i.e., users or processes acting on behalf of users) and passive entities or objects (i.e., devices, files, records, domains) in organizational systems. In addition to enforcing authorized access at the system level and recognizing that systems can host many applications and services in support of mission and business functions, access enforcement mechanisms can also be employed at the application and service level to provide increased information security and privacy. In contrast to logical access controls that are implemented within the system, physical access controls are addressed by the controls in the Physical and Environmental Protection ( [PE](#pe) ) family.",
    "group": "Access Control",
    "parent_id": "ac",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ac-7",
    "label": "AC-07",
    "title": "Unsuccessful Logon Attempts",
    "text": "Unsuccessful Logon Attempts\nEnforce a limit of {{ insert: param, ac-07_odp.01 }} consecutive invalid logon attempts by a user during a {{ insert: param, ac-07_odp.02 }} ; and\nAutomatically {{ insert: param, ac-07_odp.03 }} when the maximum number of unsuccessful attempts is exceeded.\nThe need to limit unsuccessful logon attempts and take subsequent action when the maximum number of attempts is exceeded applies regardless of whether the logon occurs via a local or network connection. Due to the potential for denial of service, automatic lockouts initiated by systems are usually temporary and automatically release after a predetermined, organization-defined time period. If a delay algorithm is selected, organizations may employ different algorithms for different components of the system based on the capabilities of those components. Responses to unsuccessful logon attempts may be implemented at the operating system and the application levels. Organization-defined actions that may be taken when the number of allowed consecutive invalid logon attempts is exceeded include prompting the user to answer a secret question in addition to the username and password, invoking a lockdown mode with limited user capabilities (instead of full lockout), allowing users to only logon from specified Internet Protocol (IP) addresses, requiring a CAPTCHA to prevent automated attacks, or applying user profiles such as location, time of day, IP address, device, or Media Access Control (MAC) address. If automatic system lockout or execution of a delay algorithm is not implemented in support of the availability objective, organizations consider a combination of other actions to help prevent brute force attacks. In addition to the above, organizations can prompt users to respond to a secret question before the number of allowed unsuccessful logon attempts is exceeded. Automatically unlocking an account after a specified period of time is generally not permitted. However, exceptions may be required based on operational mission or need.",
    "group": "Access Control",
    "parent_id": "ac",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ac-8",
    "label": "AC-08",
    "title": "System Use Notification",
    "text": "System Use Notification\nDisplay {{ insert: param, ac-08_odp.01 }} to users before granting access to the system that provides privacy and security notices consistent with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines and state that:\nRetain the notification message or banner on the screen until users acknowledge the usage conditions and take explicit actions to log on to or further access the system; and\nFor publicly accessible systems:\nSystem use notifications can be implemented using messages or warning banners displayed before individuals log in to systems. System use notifications are used only for access via logon interfaces with human users. Notifications are not required when human interfaces do not exist. Based on an assessment of risk, organizations consider whether or not a secondary system use notification is needed to access applications or other system resources after the initial network logon. Organizations consider system use notification messages or banners displayed in multiple languages based on organizational needs and the demographics of system users. Organizations consult with the privacy office for input regarding privacy messaging and the Office of the General Counsel or organizational equivalent for legal review and approval of warning banner content.",
    "group": "Access Control",
    "parent_id": "ac",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ac-14",
    "label": "AC-14",
    "title": "Permitted Actions Without Identification or Authentication",
    "text": "Permitted Actions Without Identification or Authentication\nIdentify {{ insert: param, ac-14_odp }} that can be performed on the system without identification or authentication consistent with organizational mission and business functions; and\nDocument and provide supporting rationale in the security plan for the system, user actions not requiring identification or authentication.\nSpecific user actions may be permitted without identification or authentication if organizations determine that identification and authentication are not required for the specified user actions. Organizations may allow a limited number of user actions without identification or authentication, including when individuals access public websites or other publicly accessible federal systems, when individuals use mobile phones to receive calls, or when facsimiles are received. Organizations identify actions that normally require identification or authentication but may, under certain circumstances, allow identification or authentication mechanisms to be bypassed. Such bypasses may occur, for example, via a software-readable physical switch that commands bypass of the logon functionality and is protected from accidental or unmonitored use. Permitting actions without identification or authentication does not apply to situations where identification and authentication have already occurred and are not repeated but rather to situations where identification and authentication have not yet occurred. Organizations may decide that there are no user actions that can be performed on organizational systems without identification and authentication, and therefore, the value for the assignment operation can be \"none.\"",
    "group": "Access Control",
    "parent_id": "ac",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ac-17",
    "label": "AC-17",
    "title": "Remote Access",
    "text": "Remote Access\nEstablish and document usage restrictions, configuration/connection requirements, and implementation guidance for each type of remote access allowed; and\nAuthorize each type of remote access to the system prior to allowing such connections.\nRemote access is access to organizational systems (or processes acting on behalf of users) that communicate through external networks such as the Internet. Types of remote access include dial-up, broadband, and wireless. Organizations use encrypted virtual private networks (VPNs) to enhance confidentiality and integrity for remote connections. The use of encrypted VPNs provides sufficient assurance to the organization that it can effectively treat such connections as internal networks if the cryptographic mechanisms used are implemented in accordance with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines. Still, VPN connections traverse external networks, and the encrypted VPN does not enhance the availability of remote connections. VPNs with encrypted tunnels can also affect the ability to adequately monitor network communications traffic for malicious code. Remote access controls apply to systems other than public web servers or systems designed for public access. Authorization of each remote access type addresses authorization prior to allowing remote access without specifying the specific formats for such authorization. While organizations may use information exchange and system connection security agreements to manage remote access connections to other systems, such agreements are addressed as part of [CA-3](#ca-3) . Enforcing access restrictions for remote access is addressed via [AC-3](#ac-3).",
    "group": "Access Control",
    "parent_id": "ac",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ac-18",
    "label": "AC-18",
    "title": "Wireless Access",
    "text": "Wireless Access\nEstablish configuration requirements, connection requirements, and implementation guidance for each type of wireless access; and\nAuthorize each type of wireless access to the system prior to allowing such connections.\nWireless technologies include microwave, packet radio (ultra-high frequency or very high frequency), 802.11x, and Bluetooth. Wireless networks use authentication protocols that provide authenticator protection and mutual authentication.",
    "group": "Access Control",
    "parent_id": "ac",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ac-19",
    "label": "AC-19",
    "title": "Access Control for Mobile Devices",
    "text": "Access Control for Mobile Devices\nEstablish configuration requirements, connection requirements, and implementation guidance for organization-controlled mobile devices, to include when such devices are outside of controlled areas; and\nAuthorize the connection of mobile devices to organizational systems.\nA mobile device is a computing device that has a small form factor such that it can easily be carried by a single individual; is designed to operate without a physical connection; possesses local, non-removable or removable data storage; and includes a self-contained power source. Mobile device functionality may also include voice communication capabilities, on-board sensors that allow the device to capture information, and/or built-in features for synchronizing local data with remote locations. Examples include smart phones and tablets. Mobile devices are typically associated with a single individual. The processing, storage, and transmission capability of the mobile device may be comparable to or merely a subset of notebook/desktop systems, depending on the nature and intended purpose of the device. Protection and control of mobile devices is behavior or policy-based and requires users to take physical action to protect and control such devices when outside of controlled areas. Controlled areas are spaces for which organizations provide physical or procedural controls to meet the requirements established for protecting information and systems.\n\nDue to the large variety of mobile devices with different characteristics and capabilities, organizational restrictions may vary for the different classes or types of such devices. Usage restrictions and specific implementation guidance for mobile devices include configuration management, device identification and authentication, implementation of mandatory protective software, scanning devices for malicious code, updating virus protection software, scanning for critical software updates and patches, conducting primary operating system (and possibly other resident software) integrity checks, and disabling unnecessary hardware.\n\nUsage restrictions and authorization to connect may vary among organizational systems. For example, the organization may authorize the connection of mobile devices to its network and impose a set of usage restrictions, while a system owner may withhold authorization for mobile device connection to specific applications or impose additional usage restrictions before allowing mobile device connections to a system. Adequate security for mobile devices goes beyond the requirements specified in [AC-19](#ac-19) . Many safeguards for mobile devices are reflected in other controls. [AC-20](#ac-20) addresses mobile devices that are not organization-controlled.",
    "group": "Access Control",
    "parent_id": "ac",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ac-20",
    "label": "AC-20",
    "title": "Use of External Systems",
    "text": "Use of External Systems\n{{ insert: param, ac-20_odp.01 }} , consistent with the trust relationships established with other organizations owning, operating, and/or maintaining external systems, allowing authorized individuals to:\nProhibit the use of {{ insert: param, ac-20_odp.04 }}.\nExternal systems are systems that are used by but not part of organizational systems, and for which the organization has no direct control over the implementation of required controls or the assessment of control effectiveness. External systems include personally owned systems, components, or devices; privately owned computing and communications devices in commercial or public facilities; systems owned or controlled by nonfederal organizations; systems managed by contractors; and federal information systems that are not owned by, operated by, or under the direct supervision or authority of the organization. External systems also include systems owned or operated by other components within the same organization and systems within the organization with different authorization boundaries. Organizations have the option to prohibit the use of any type of external system or prohibit the use of specified types of external systems, (e.g., prohibit the use of any external system that is not organizationally owned or prohibit the use of personally-owned systems).\n\nFor some external systems (i.e., systems operated by other organizations), the trust relationships that have been established between those organizations and the originating organization may be such that no explicit terms and conditions are required. Systems within these organizations may not be considered external. These situations occur when, for example, there are pre-existing information exchange agreements (either implicit or explicit) established between organizations or components or when such agreements are specified by applicable laws, executive orders, directives, regulations, policies, or standards. Authorized individuals include organizational personnel, contractors, or other individuals with authorized access to organizational systems and over which organizations have the authority to impose specific rules of behavior regarding system access. Restrictions that organizations impose on authorized individuals need not be uniform, as the restrictions may vary depending on trust relationships between organizations. Therefore, organizations may choose to impose different security restrictions on contractors than on state, local, or tribal governments.\n\nExternal systems used to access public interfaces to organizational systems are outside the scope of [AC-20](#ac-20) . Organizations establish specific terms and conditions for the use of external systems in accordance with organizational security policies and procedures. At a minimum, terms and conditions address the specific types of applications that can be accessed on organizational systems from external systems and the highest security category of information that can be processed, stored, or transmitted on external systems. If the terms and conditions with the owners of the external systems cannot be established, organizations may impose restrictions on organizational personnel using those external systems.",
    "group": "Access Control",
    "parent_id": "ac",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ac-22",
    "label": "AC-22",
    "title": "Publicly Accessible Content",
    "text": "Publicly Accessible Content\nDesignate individuals authorized to make information publicly accessible;\nTrain authorized individuals to ensure that publicly accessible information does not contain nonpublic information;\nReview the proposed content of information prior to posting onto the publicly accessible system to ensure that nonpublic information is not included; and\nReview the content on the publicly accessible system for nonpublic information {{ insert: param, ac-22_odp }} and remove such information, if discovered.\nIn accordance with applicable laws, executive orders, directives, policies, regulations, standards, and guidelines, the public is not authorized to have access to nonpublic information, including information protected under the [PRIVACT](#18e71fec-c6fd-475a-925a-5d8495cf8455) and proprietary information. Publicly accessible content addresses systems that are controlled by the organization and accessible to the public, typically without identification or authentication. Posting information on non-organizational systems (e.g., non-organizational public websites, forums, and social media) is covered by organizational policy. While organizations may have individuals who are responsible for developing and implementing policies about the information that can be made publicly accessible, publicly accessible content addresses the management of the individuals who make such information publicly accessible.",
    "group": "Access Control",
    "parent_id": "ac",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "at-1",
    "label": "AT-01",
    "title": "Policy and Procedures",
    "text": "Policy and Procedures\nDevelop, document, and disseminate to {{ insert: param, at-1_prm_1 }}:\nDesignate an {{ insert: param, at-01_odp.04 }} to manage the development, documentation, and dissemination of the awareness and training policy and procedures; and\nReview and update the current awareness and training:\nAwareness and training policy and procedures address the controls in the AT family that are implemented within systems and organizations. The risk management strategy is an important factor in establishing such policies and procedures. Policies and procedures contribute to security and privacy assurance. Therefore, it is important that security and privacy programs collaborate on the development of awareness and training policy and procedures. Security and privacy program policies and procedures at the organization level are preferable, in general, and may obviate the need for mission- or system-specific policies and procedures. The policy can be included as part of the general security and privacy policy or be represented by multiple policies that reflect the complex nature of organizations. Procedures can be established for security and privacy programs, for mission or business processes, and for systems, if needed. Procedures describe how the policies or controls are implemented and can be directed at the individual or role that is the object of the procedure. Procedures can be documented in system security and privacy plans or in one or more separate documents. Events that may precipitate an update to awareness and training policy and procedures include assessment or audit findings, security incidents or breaches, or changes in applicable laws, executive orders, directives, regulations, policies, standards, and guidelines. Simply restating controls does not constitute an organizational policy or procedure.",
    "group": "Awareness and Training",
    "parent_id": "at",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "at-2",
    "label": "AT-02",
    "title": "Literacy Training and Awareness",
    "text": "Literacy Training and Awareness\nProvide security and privacy literacy training to system users (including managers, senior executives, and contractors):\nEmploy the following techniques to increase the security and privacy awareness of system users {{ insert: param, at-02_odp.05 }};\nUpdate literacy training and awareness content {{ insert: param, at-02_odp.06 }} and following {{ insert: param, at-02_odp.07 }} ; and\nIncorporate lessons learned from internal or external security incidents or breaches into literacy training and awareness techniques.\nOrganizations provide basic and advanced levels of literacy training to system users, including measures to test the knowledge level of users. Organizations determine the content of literacy training and awareness based on specific organizational requirements, the systems to which personnel have authorized access, and work environments (e.g., telework). The content includes an understanding of the need for security and privacy as well as actions by users to maintain security and personal privacy and to respond to suspected incidents. The content addresses the need for operations security and the handling of personally identifiable information.\n\nAwareness techniques include displaying posters, offering supplies inscribed with security and privacy reminders, displaying logon screen messages, generating email advisories or notices from organizational officials, and conducting awareness events. Literacy training after the initial training described in [AT-2a.1](#at-2_smt.a.1) is conducted at a minimum frequency consistent with applicable laws, directives, regulations, and policies. Subsequent literacy training may be satisfied by one or more short ad hoc sessions and include topical information on recent attack schemes, changes to organizational security and privacy policies, revised security and privacy expectations, or a subset of topics from the initial training. Updating literacy training and awareness content on a regular basis helps to ensure that the content remains relevant. Events that may precipitate an update to literacy training and awareness content include, but are not limited to, assessment or audit findings, security incidents or breaches, or changes in applicable laws, executive orders, directives, regulations, policies, standards, and guidelines.",
    "group": "Awareness and Training",
    "parent_id": "at",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "at-2.2",
    "label": "AT-02(02)",
    "title": "Insider Threat",
    "text": "Insider Threat\nProvide literacy training on recognizing and reporting potential indicators of insider threat.\nPotential indicators and possible precursors of insider threat can include behaviors such as inordinate, long-term job dissatisfaction; attempts to gain access to information not required for job performance; unexplained access to financial resources; bullying or harassment of fellow employees; workplace violence; and other serious violations of policies, procedures, directives, regulations, rules, or practices. Literacy training includes how to communicate the concerns of employees and management regarding potential indicators of insider threat through channels established by the organization and in accordance with established policies and procedures. Organizations may consider tailoring insider threat awareness topics to the role. For example, training for managers may be focused on changes in the behavior of team members, while training for employees may be focused on more general observations.",
    "group": "Awareness and Training",
    "parent_id": "at-2",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "at-3",
    "label": "AT-03",
    "title": "Role-based Training",
    "text": "Role-based Training\nProvide role-based security and privacy training to personnel with the following roles and responsibilities: {{ insert: param, at-3_prm_1 }}:\nUpdate role-based training content {{ insert: param, at-03_odp.04 }} and following {{ insert: param, at-03_odp.05 }} ; and\nIncorporate lessons learned from internal or external security incidents or breaches into role-based training.\nOrganizations determine the content of training based on the assigned roles and responsibilities of individuals as well as the security and privacy requirements of organizations and the systems to which personnel have authorized access, including technical training specifically tailored for assigned duties. Roles that may require role-based training include senior leaders or management officials (e.g., head of agency/chief executive officer, chief information officer, senior accountable official for risk management, senior agency information security officer, senior agency official for privacy), system owners; authorizing officials; system security officers; privacy officers; acquisition and procurement officials; enterprise architects; systems engineers; software developers; systems security engineers; privacy engineers; system, network, and database administrators; auditors; personnel conducting configuration management activities; personnel performing verification and validation activities; personnel with access to system-level software; control assessors; personnel with contingency planning and incident response duties; personnel with privacy management responsibilities; and personnel with access to personally identifiable information.\n\nComprehensive role-based training addresses management, operational, and technical roles and responsibilities covering physical, personnel, and technical controls. Role-based training also includes policies, procedures, tools, methods, and artifacts for the security and privacy roles defined. Organizations provide the training necessary for individuals to fulfill their responsibilities related to operations and supply chain risk management within the context of organizational security and privacy programs. Role-based training also applies to contractors who provide services to federal agencies. Types of training include web-based and computer-based training, classroom-style training, and hands-on training (including micro-training). Updating role-based training on a regular basis helps to ensure that the content remains relevant and effective. Events that may precipitate an update to role-based training content include, but are not limited to, assessment or audit findings, security incidents or breaches, or changes in applicable laws, executive orders, directives, regulations, policies, standards, and guidelines.",
    "group": "Awareness and Training",
    "parent_id": "at",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "at-4",
    "label": "AT-04",
    "title": "Training Records",
    "text": "Training Records\nDocument and monitor information security and privacy training activities, including security and privacy awareness training and specific role-based security and privacy training; and\nRetain individual training records for {{ insert: param, at-04_odp }}.\nDocumentation for specialized training may be maintained by individual supervisors at the discretion of the organization. The National Archives and Records Administration provides guidance on records retention for federal agencies.",
    "group": "Awareness and Training",
    "parent_id": "at",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "au-1",
    "label": "AU-01",
    "title": "Policy and Procedures",
    "text": "Policy and Procedures\nDevelop, document, and disseminate to {{ insert: param, au-1_prm_1 }}:\nDesignate an {{ insert: param, au-01_odp.04 }} to manage the development, documentation, and dissemination of the audit and accountability policy and procedures; and\nReview and update the current audit and accountability:\nAudit and accountability policy and procedures address the controls in the AU family that are implemented within systems and organizations. The risk management strategy is an important factor in establishing such policies and procedures. Policies and procedures contribute to security and privacy assurance. Therefore, it is important that security and privacy programs collaborate on the development of audit and accountability policy and procedures. Security and privacy program policies and procedures at the organization level are preferable, in general, and may obviate the need for mission- or system-specific policies and procedures. The policy can be included as part of the general security and privacy policy or be represented by multiple policies that reflect the complex nature of organizations. Procedures can be established for security and privacy programs, for mission or business processes, and for systems, if needed. Procedures describe how the policies or controls are implemented and can be directed at the individual or role that is the object of the procedure. Procedures can be documented in system security and privacy plans or in one or more separate documents. Events that may precipitate an update to audit and accountability policy and procedures include assessment or audit findings, security incidents or breaches, or changes in applicable laws, executive orders, directives, regulations, policies, standards, and guidelines. Simply restating controls does not constitute an organizational policy or procedure.",
    "group": "Audit and Accountability",
    "parent_id": "au",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "au-2",
    "label": "AU-02",
    "title": "Event Logging",
    "text": "Event Logging\nIdentify the types of events that the system is capable of logging in support of the audit function: {{ insert: param, au-02_odp.01 }};\nCoordinate the event logging function with other organizational entities requiring audit-related information to guide and inform the selection criteria for events to be logged;\nSpecify the following event types for logging within the system: {{ insert: param, au-2_prm_2 }};\nProvide a rationale for why the event types selected for logging are deemed to be adequate to support after-the-fact investigations of incidents; and\nReview and update the event types selected for logging {{ insert: param, au-02_odp.04 }}.\nAn event is an observable occurrence in a system. The types of events that require logging are those events that are significant and relevant to the security of systems and the privacy of individuals. Event logging also supports specific monitoring and auditing needs. Event types include password changes, failed logons or failed accesses related to systems, security or privacy attribute changes, administrative privilege usage, PIV credential usage, data action changes, query parameters, or external credential usage. In determining the set of event types that require logging, organizations consider the monitoring and auditing appropriate for each of the controls to be implemented. For completeness, event logging includes all protocols that are operational and supported by the system.\n\nTo balance monitoring and auditing requirements with other system needs, event logging requires identifying the subset of event types that are logged at a given point in time. For example, organizations may determine that systems need the capability to log every file access successful and unsuccessful, but not activate that capability except for specific circumstances due to the potential burden on system performance. The types of events that organizations desire to be logged may change. Reviewing and updating the set of logged events is necessary to help ensure that the events remain relevant and continue to support the needs of the organization. Organizations consider how the types of logging events can reveal information about individuals that may give rise to privacy risk and how best to mitigate such risks. For example, there is the potential to reveal personally identifiable information in the audit trail, especially if the logging event is based on patterns or time of usage.\n\nEvent logging requirements, including the need to log specific event types, may be referenced in other controls and control enhancements. These include [AC-2(4)](#ac-2.4), [AC-3(10)](#ac-3.10), [AC-6(9)](#ac-6.9), [AC-17(1)](#ac-17.1), [CM-3f](#cm-3_smt.f), [CM-5(1)](#cm-5.1), [IA-3(3)(b)](#ia-3.3_smt.b), [MA-4(1)](#ma-4.1), [MP-4(2)](#mp-4.2), [PE-3](#pe-3), [PM-21](#pm-21), [PT-7](#pt-7), [RA-8](#ra-8), [SC-7(9)](#sc-7.9), [SC-7(15)](#sc-7.15), [SI-3(8)](#si-3.8), [SI-4(22)](#si-4.22), [SI-7(8)](#si-7.8) , and [SI-10(1)](#si-10.1) . Organizations include event types that are required by applicable laws, executive orders, directives, policies, regulations, standards, and guidelines. Audit records can be generated at various levels, including at the packet level as information traverses the network. Selecting the appropriate level of event logging is an important part of a monitoring and auditing capability and can identify the root causes of problems. When defining event types, organizations consider the logging necessary to cover related event types, such as the steps in distributed, transaction-based processes and the actions that occur in service-oriented architectures.",
    "group": "Audit and Accountability",
    "parent_id": "au",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "au-3",
    "label": "AU-03",
    "title": "Content of Audit Records",
    "text": "Content of Audit Records\nEnsure that audit records contain information that establishes the following:\nWhat type of event occurred;\nWhen the event occurred;\nWhere the event occurred;\nSource of the event;\nOutcome of the event; and\nIdentity of any individuals, subjects, or objects/entities associated with the event.\nAudit record content that may be necessary to support the auditing function includes event descriptions (item a), time stamps (item b), source and destination addresses (item c), user or process identifiers (items d and f), success or fail indications (item e), and filenames involved (items a, c, e, and f) . Event outcomes include indicators of event success or failure and event-specific results, such as the system security and privacy posture after the event occurred. Organizations consider how audit records can reveal information about individuals that may give rise to privacy risks and how best to mitigate such risks. For example, there is the potential to reveal personally identifiable information in the audit trail, especially if the trail records inputs or is based on patterns or time of usage.",
    "group": "Audit and Accountability",
    "parent_id": "au",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "au-4",
    "label": "AU-04",
    "title": "Audit Log Storage Capacity",
    "text": "Audit Log Storage Capacity\nAllocate audit log storage capacity to accommodate {{ insert: param, au-04_odp }}.\nOrganizations consider the types of audit logging to be performed and the audit log processing requirements when allocating audit log storage capacity. Allocating sufficient audit log storage capacity reduces the likelihood of such capacity being exceeded and resulting in the potential loss or reduction of audit logging capability.",
    "group": "Audit and Accountability",
    "parent_id": "au",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "au-5",
    "label": "AU-05",
    "title": "Response to Audit Logging Process Failures",
    "text": "Response to Audit Logging Process Failures\nAlert {{ insert: param, au-05_odp.01 }} within {{ insert: param, au-05_odp.02 }} in the event of an audit logging process failure; and\nTake the following additional actions: {{ insert: param, au-05_odp.03 }}.\nAudit logging process failures include software and hardware errors, failures in audit log capturing mechanisms, and reaching or exceeding audit log storage capacity. Organization-defined actions include overwriting oldest audit records, shutting down the system, and stopping the generation of audit records. Organizations may choose to define additional actions for audit logging process failures based on the type of failure, the location of the failure, the severity of the failure, or a combination of such factors. When the audit logging process failure is related to storage, the response is carried out for the audit log storage repository (i.e., the distinct system component where the audit logs are stored), the system on which the audit logs reside, the total audit log storage capacity of the organization (i.e., all audit log storage repositories combined), or all three. Organizations may decide to take no additional actions after alerting designated roles or personnel.",
    "group": "Audit and Accountability",
    "parent_id": "au",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "au-6",
    "label": "AU-06",
    "title": "Audit Record Review, Analysis, and Reporting",
    "text": "Audit Record Review, Analysis, and Reporting\nReview and analyze system audit records {{ insert: param, au-06_odp.01 }} for indications of {{ insert: param, au-06_odp.02 }} and the potential impact of the inappropriate or unusual activity;\nReport findings to {{ insert: param, au-06_odp.03 }} ; and\nAdjust the level of audit record review, analysis, and reporting within the system when there is a change in risk based on law enforcement information, intelligence information, or other credible sources of information.\nAudit record review, analysis, and reporting covers information security- and privacy-related logging performed by organizations, including logging that results from the monitoring of account usage, remote access, wireless connectivity, mobile device connection, configuration settings, system component inventory, use of maintenance tools and non-local maintenance, physical access, temperature and humidity, equipment delivery and removal, communications at system interfaces, and use of mobile code or Voice over Internet Protocol (VoIP). Findings can be reported to organizational entities that include the incident response team, help desk, and security or privacy offices. If organizations are prohibited from reviewing and analyzing audit records or unable to conduct such activities, the review or analysis may be carried out by other organizations granted such authority. The frequency, scope, and/or depth of the audit record review, analysis, and reporting may be adjusted to meet organizational needs based on new information received.",
    "group": "Audit and Accountability",
    "parent_id": "au",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "au-8",
    "label": "AU-08",
    "title": "Time Stamps",
    "text": "Time Stamps\nUse internal system clocks to generate time stamps for audit records; and\nRecord time stamps for audit records that meet {{ insert: param, au-08_odp }} and that use Coordinated Universal Time, have a fixed local time offset from Coordinated Universal Time, or that include the local time offset as part of the time stamp.\nTime stamps generated by the system include date and time. Time is commonly expressed in Coordinated Universal Time (UTC), a modern continuation of Greenwich Mean Time (GMT), or local time with an offset from UTC. Granularity of time measurements refers to the degree of synchronization between system clocks and reference clocks (e.g., clocks synchronizing within hundreds of milliseconds or tens of milliseconds). Organizations may define different time granularities for different system components. Time service can be critical to other security capabilities such as access control and identification and authentication, depending on the nature of the mechanisms used to support those capabilities.",
    "group": "Audit and Accountability",
    "parent_id": "au",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "au-9",
    "label": "AU-09",
    "title": "Protection of Audit Information",
    "text": "Protection of Audit Information\nProtect audit information and audit logging tools from unauthorized access, modification, and deletion; and\nAlert {{ insert: param, au-09_odp }} upon detection of unauthorized access, modification, or deletion of audit information.\nAudit information includes all information needed to successfully audit system activity, such as audit records, audit log settings, audit reports, and personally identifiable information. Audit logging tools are those programs and devices used to conduct system audit and logging activities. Protection of audit information focuses on technical protection and limits the ability to access and execute audit logging tools to authorized individuals. Physical protection of audit information is addressed by both media protection controls and physical and environmental protection controls.",
    "group": "Audit and Accountability",
    "parent_id": "au",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "au-11",
    "label": "AU-11",
    "title": "Audit Record Retention",
    "text": "Audit Record Retention\nRetain audit records for {{ insert: param, au-11_odp }} to provide support for after-the-fact investigations of incidents and to meet regulatory and organizational information retention requirements.\nOrganizations retain audit records until it is determined that the records are no longer needed for administrative, legal, audit, or other operational purposes. This includes the retention and availability of audit records relative to Freedom of Information Act (FOIA) requests, subpoenas, and law enforcement actions. Organizations develop standard categories of audit records relative to such types of actions and standard response processes for each type of action. The National Archives and Records Administration (NARA) General Records Schedules provide federal policy on records retention.",
    "group": "Audit and Accountability",
    "parent_id": "au",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "au-12",
    "label": "AU-12",
    "title": "Audit Record Generation",
    "text": "Audit Record Generation\nProvide audit record generation capability for the event types the system is capable of auditing as defined in [AU-2a](#au-2_smt.a) on {{ insert: param, au-12_odp.01 }};\nAllow {{ insert: param, au-12_odp.02 }} to select the event types that are to be logged by specific components of the system; and\nGenerate audit records for the event types defined in [AU-2c](#au-2_smt.c) that include the audit record content defined in [AU-3](#au-3).\nAudit records can be generated from many different system components. The event types specified in [AU-2d](#au-2_smt.d) are the event types for which audit logs are to be generated and are a subset of all event types for which the system can generate audit records.",
    "group": "Audit and Accountability",
    "parent_id": "au",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ca-1",
    "label": "CA-01",
    "title": "Policy and Procedures",
    "text": "Policy and Procedures\nDevelop, document, and disseminate to {{ insert: param, ca-1_prm_1 }}:\nDesignate an {{ insert: param, ca-01_odp.04 }} to manage the development, documentation, and dissemination of the assessment, authorization, and monitoring policy and procedures; and\nReview and update the current assessment, authorization, and monitoring:\nAssessment, authorization, and monitoring policy and procedures address the controls in the CA family that are implemented within systems and organizations. The risk management strategy is an important factor in establishing such policies and procedures. Policies and procedures contribute to security and privacy assurance. Therefore, it is important that security and privacy programs collaborate on the development of assessment, authorization, and monitoring policy and procedures. Security and privacy program policies and procedures at the organization level are preferable, in general, and may obviate the need for mission- or system-specific policies and procedures. The policy can be included as part of the general security and privacy policy or be represented by multiple policies that reflect the complex nature of organizations. Procedures can be established for security and privacy programs, for mission or business processes, and for systems, if needed. Procedures describe how the policies or controls are implemented and can be directed at the individual or role that is the object of the procedure. Procedures can be documented in system security and privacy plans or in one or more separate documents. Events that may precipitate an update to assessment, authorization, and monitoring policy and procedures include assessment or audit findings, security incidents or breaches, or changes in applicable laws, executive orders, directives, regulations, policies, standards, and guidelines. Simply restating controls does not constitute an organizational policy or procedure.",
    "group": "Assessment, Authorization, and Monitoring",
    "parent_id": "ca",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ca-2",
    "label": "CA-02",
    "title": "Control Assessments",
    "text": "Control Assessments\nSelect the appropriate assessor or assessment team for the type of assessment to be conducted;\nDevelop a control assessment plan that describes the scope of the assessment including:\nEnsure the control assessment plan is reviewed and approved by the authorizing official or designated representative prior to conducting the assessment;\nAssess the controls in the system and its environment of operation {{ insert: param, ca-02_odp.01 }} to determine the extent to which the controls are implemented correctly, operating as intended, and producing the desired outcome with respect to meeting established security and privacy requirements;\nProduce a control assessment report that document the results of the assessment; and\nProvide the results of the control assessment to {{ insert: param, ca-02_odp.02 }}.\nOrganizations ensure that control assessors possess the required skills and technical expertise to develop effective assessment plans and to conduct assessments of system-specific, hybrid, common, and program management controls, as appropriate. The required skills include general knowledge of risk management concepts and approaches as well as comprehensive knowledge of and experience with the hardware, software, and firmware system components implemented.\n\nOrganizations assess controls in systems and the environments in which those systems operate as part of initial and ongoing authorizations, continuous monitoring, FISMA annual assessments, system design and development, systems security engineering, privacy engineering, and the system development life cycle. Assessments help to ensure that organizations meet information security and privacy requirements, identify weaknesses and deficiencies in the system design and development process, provide essential information needed to make risk-based decisions as part of authorization processes, and comply with vulnerability mitigation procedures. Organizations conduct assessments on the implemented controls as documented in security and privacy plans. Assessments can also be conducted throughout the system development life cycle as part of systems engineering and systems security engineering processes. The design for controls can be assessed as RFPs are developed, responses assessed, and design reviews conducted. If a design to implement controls and subsequent implementation in accordance with the design are assessed during development, the final control testing can be a simple confirmation utilizing previously completed control assessment and aggregating the outcomes.\n\nOrganizations may develop a single, consolidated security and privacy assessment plan for the system or maintain separate plans. A consolidated assessment plan clearly delineates the roles and responsibilities for control assessment. If multiple organizations participate in assessing a system, a coordinated approach can reduce redundancies and associated costs.\n\nOrganizations can use other types of assessment activities, such as vulnerability scanning and system monitoring, to maintain the security and privacy posture of systems during the system life cycle. Assessment reports document assessment results in sufficient detail, as deemed necessary by organizations, to determine the accuracy and completeness of the reports and whether the controls are implemented correctly, operating as intended, and producing the desired outcome with respect to meeting requirements. Assessment results are provided to the individuals or roles appropriate for the types of assessments being conducted. For example, assessments conducted in support of authorization decisions are provided to authorizing officials, senior agency officials for privacy, senior agency information security officers, and authorizing official designated representatives.\n\nTo satisfy annual assessment requirements, organizations can use assessment results from the following sources: initial or ongoing system authorizations, continuous monitoring, systems engineering processes, or system development life cycle activities. Organizations ensure that assessment results are current, relevant to the determination of control effectiveness, and obtained with the appropriate level of assessor independence. Existing control assessment results can be reused to the extent that the results are still valid and can also be supplemented with additional assessments as needed. After the initial authorizations, organizations assess controls during continuous monitoring. Organizations also establish the frequency for ongoing assessments in accordance with organizational continuous monitoring strategies. External audits, including audits by external entities such as regulatory agencies, are outside of the scope of [CA-2](#ca-2).",
    "group": "Assessment, Authorization, and Monitoring",
    "parent_id": "ca",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ca-2.1",
    "label": "CA-02(01)",
    "title": "Independent Assessors",
    "text": "Independent Assessors\nEmploy independent assessors or assessment teams to conduct control assessments.\nIndependent assessors or assessment teams are individuals or groups who conduct impartial assessments of systems. Impartiality means that assessors are free from any perceived or actual conflicts of interest regarding the development, operation, sustainment, or management of the systems under assessment or the determination of control effectiveness. To achieve impartiality, assessors do not create a mutual or conflicting interest with the organizations where the assessments are being conducted, assess their own work, act as management or employees of the organizations they are serving, or place themselves in positions of advocacy for the organizations acquiring their services.\n\nIndependent assessments can be obtained from elements within organizations or be contracted to public or private sector entities outside of organizations. Authorizing officials determine the required level of independence based on the security categories of systems and/or the risk to organizational operations, organizational assets, or individuals. Authorizing officials also determine if the level of assessor independence provides sufficient assurance that the results are sound and can be used to make credible, risk-based decisions. Assessor independence determination includes whether contracted assessment services have sufficient independence, such as when system owners are not directly involved in contracting processes or cannot influence the impartiality of the assessors conducting the assessments. During the system design and development phase, having independent assessors is analogous to having independent SMEs involved in design reviews.\n\nWhen organizations that own the systems are small or the structures of the organizations require that assessments be conducted by individuals that are in the developmental, operational, or management chain of the system owners, independence in assessment processes can be achieved by ensuring that assessment results are carefully reviewed and analyzed by independent teams of experts to validate the completeness, accuracy, integrity, and reliability of the results. Assessments performed for purposes other than to support authorization decisions are more likely to be useable for such decisions when performed by assessors with sufficient independence, thereby reducing the need to repeat assessments.",
    "group": "Assessment, Authorization, and Monitoring",
    "parent_id": "ca-2",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ca-3",
    "label": "CA-03",
    "title": "Information Exchange",
    "text": "Information Exchange\nApprove and manage the exchange of information between the system and other systems using {{ insert: param, ca-03_odp.01 }};\nDocument, as part of each exchange agreement, the interface characteristics, security and privacy requirements, controls, and responsibilities for each system, and the impact level of the information communicated; and\nReview and update the agreements {{ insert: param, ca-03_odp.03 }}.\nSystem information exchange requirements apply to information exchanges between two or more systems. System information exchanges include connections via leased lines or virtual private networks, connections to internet service providers, database sharing or exchanges of database transaction information, connections and exchanges with cloud services, exchanges via web-based services, or exchanges of files via file transfer protocols, network protocols (e.g., IPv4, IPv6), email, or other organization-to-organization communications. Organizations consider the risk related to new or increased threats that may be introduced when systems exchange information with other systems that may have different security and privacy requirements and controls. This includes systems within the same organization and systems that are external to the organization. A joint authorization of the systems exchanging information, as described in [CA-6(1)](#ca-6.1) or [CA-6(2)](#ca-6.2) , may help to communicate and reduce risk.\n\nAuthorizing officials determine the risk associated with system information exchange and the controls needed for appropriate risk mitigation. The types of agreements selected are based on factors such as the impact level of the information being exchanged, the relationship between the organizations exchanging information (e.g., government to government, government to business, business to business, government or business to service provider, government or business to individual), or the level of access to the organizational system by users of the other system. If systems that exchange information have the same authorizing official, organizations need not develop agreements. Instead, the interface characteristics between the systems (e.g., how the information is being exchanged. how the information is protected) are described in the respective security and privacy plans. If the systems that exchange information have different authorizing officials within the same organization, the organizations can develop agreements or provide the same information that would be provided in the appropriate agreement type from [CA-3a](#ca-3_smt.a) in the respective security and privacy plans for the systems. Organizations may incorporate agreement information into formal contracts, especially for information exchanges established between federal agencies and nonfederal organizations (including service providers, contractors, system developers, and system integrators). Risk considerations include systems that share the same networks.",
    "group": "Assessment, Authorization, and Monitoring",
    "parent_id": "ca",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ca-5",
    "label": "CA-05",
    "title": "Plan of Action and Milestones",
    "text": "Plan of Action and Milestones\nDevelop a plan of action and milestones for the system to document the planned remediation actions of the organization to correct weaknesses or deficiencies noted during the assessment of the controls and to reduce or eliminate known vulnerabilities in the system; and\nUpdate existing plan of action and milestones {{ insert: param, ca-05_odp }} based on the findings from control assessments, independent audits or reviews, and continuous monitoring activities.\nPlans of action and milestones are useful for any type of organization to track planned remedial actions. Plans of action and milestones are required in authorization packages and subject to federal reporting requirements established by OMB.",
    "group": "Assessment, Authorization, and Monitoring",
    "parent_id": "ca",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ca-6",
    "label": "CA-06",
    "title": "Authorization",
    "text": "Authorization\nAssign a senior official as the authorizing official for the system;\nAssign a senior official as the authorizing official for common controls available for inheritance by organizational systems;\nEnsure that the authorizing official for the system, before commencing operations:\nEnsure that the authorizing official for common controls authorizes the use of those controls for inheritance by organizational systems;\nUpdate the authorizations {{ insert: param, ca-06_odp }}.\nAuthorizations are official management decisions by senior officials to authorize operation of systems, authorize the use of common controls for inheritance by organizational systems, and explicitly accept the risk to organizational operations and assets, individuals, other organizations, and the Nation based on the implementation of agreed-upon controls. Authorizing officials provide budgetary oversight for organizational systems and common controls or assume responsibility for the mission and business functions supported by those systems or common controls. The authorization process is a federal responsibility, and therefore, authorizing officials must be federal employees. Authorizing officials are both responsible and accountable for security and privacy risks associated with the operation and use of organizational systems. Nonfederal organizations may have similar processes to authorize systems and senior officials that assume the authorization role and associated responsibilities.\n\nAuthorizing officials issue ongoing authorizations of systems based on evidence produced from implemented continuous monitoring programs. Robust continuous monitoring programs reduce the need for separate reauthorization processes. Through the employment of comprehensive continuous monitoring processes, the information contained in authorization packages (i.e., security and privacy plans, assessment reports, and plans of action and milestones) is updated on an ongoing basis. This provides authorizing officials, common control providers, and system owners with an up-to-date status of the security and privacy posture of their systems, controls, and operating environments. To reduce the cost of reauthorization, authorizing officials can leverage the results of continuous monitoring processes to the maximum extent possible as the basis for rendering reauthorization decisions.",
    "group": "Assessment, Authorization, and Monitoring",
    "parent_id": "ca",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ca-7",
    "label": "CA-07",
    "title": "Continuous Monitoring",
    "text": "Continuous Monitoring\nDevelop a system-level continuous monitoring strategy and implement continuous monitoring in accordance with the organization-level continuous monitoring strategy that includes:\nEstablishing the following system-level metrics to be monitored: {{ insert: param, ca-07_odp.01 }};\nEstablishing {{ insert: param, ca-07_odp.02 }} for monitoring and {{ insert: param, ca-07_odp.03 }} for assessment of control effectiveness;\nOngoing control assessments in accordance with the continuous monitoring strategy;\nOngoing monitoring of system and organization-defined metrics in accordance with the continuous monitoring strategy;\nCorrelation and analysis of information generated by control assessments and monitoring;\nResponse actions to address results of the analysis of control assessment and monitoring information; and\nReporting the security and privacy status of the system to {{ insert: param, ca-7_prm_4 }} {{ insert: param, ca-7_prm_5 }}.\nContinuous monitoring at the system level facilitates ongoing awareness of the system security and privacy posture to support organizational risk management decisions. The terms \"continuous\" and \"ongoing\" imply that organizations assess and monitor their controls and risks at a frequency sufficient to support risk-based decisions. Different types of controls may require different monitoring frequencies. The results of continuous monitoring generate risk response actions by organizations. When monitoring the effectiveness of multiple controls that have been grouped into capabilities, a root-cause analysis may be needed to determine the specific control that has failed. Continuous monitoring programs allow organizations to maintain the authorizations of systems and common controls in highly dynamic environments of operation with changing mission and business needs, threats, vulnerabilities, and technologies. Having access to security and privacy information on a continuing basis through reports and dashboards gives organizational officials the ability to make effective and timely risk management decisions, including ongoing authorization decisions.\n\nAutomation supports more frequent updates to hardware, software, and firmware inventories, authorization packages, and other system information. Effectiveness is further enhanced when continuous monitoring outputs are formatted to provide information that is specific, measurable, actionable, relevant, and timely. Continuous monitoring activities are scaled in accordance with the security categories of systems. Monitoring requirements, including the need for specific monitoring, may be referenced in other controls and control enhancements, such as [AC-2g](#ac-2_smt.g), [AC-2(7)](#ac-2.7), [AC-2(12)(a)](#ac-2.12_smt.a), [AC-2(7)(b)](#ac-2.7_smt.b), [AC-2(7)(c)](#ac-2.7_smt.c), [AC-17(1)](#ac-17.1), [AT-4a](#at-4_smt.a), [AU-13](#au-13), [AU-13(1)](#au-13.1), [AU-13(2)](#au-13.2), [CM-3f](#cm-3_smt.f), [CM-6d](#cm-6_smt.d), [CM-11c](#cm-11_smt.c), [IR-5](#ir-5), [MA-2b](#ma-2_smt.b), [MA-3a](#ma-3_smt.a), [MA-4a](#ma-4_smt.a), [PE-3d](#pe-3_smt.d), [PE-6](#pe-6), [PE-14b](#pe-14_smt.b), [PE-16](#pe-16), [PE-20](#pe-20), [PM-6](#pm-6), [PM-23](#pm-23), [PM-31](#pm-31), [PS-7e](#ps-7_smt.e), [SA-9c](#sa-9_smt.c), [SR-4](#sr-4), [SC-5(3)(b)](#sc-5.3_smt.b), [SC-7a](#sc-7_smt.a), [SC-7(24)(b)](#sc-7.24_smt.b), [SC-18b](#sc-18_smt.b), [SC-43b](#sc-43_smt.b) , and [SI-4](#si-4).",
    "group": "Assessment, Authorization, and Monitoring",
    "parent_id": "ca",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ca-7.4",
    "label": "CA-07(04)",
    "title": "Risk Monitoring",
    "text": "Risk Monitoring\nEnsure risk monitoring is an integral part of the continuous monitoring strategy that includes the following:\nEffectiveness monitoring;\nCompliance monitoring; and\nChange monitoring.\nRisk monitoring is informed by the established organizational risk tolerance. Effectiveness monitoring determines the ongoing effectiveness of the implemented risk response measures. Compliance monitoring verifies that required risk response measures are implemented. It also verifies that security and privacy requirements are satisfied. Change monitoring identifies changes to organizational systems and environments of operation that may affect security and privacy risk.",
    "group": "Assessment, Authorization, and Monitoring",
    "parent_id": "ca-7",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ca-8",
    "label": "CA-08",
    "title": "Penetration Testing",
    "text": "Penetration Testing\nConduct penetration testing {{ insert: param, ca-08_odp.01 }} on {{ insert: param, ca-08_odp.02 }}.\nPenetration testing is a specialized type of assessment conducted on systems or individual system components to identify vulnerabilities that could be exploited by adversaries. Penetration testing goes beyond automated vulnerability scanning and is conducted by agents and teams with demonstrable skills and experience that include technical expertise in network, operating system, and/or application level security. Penetration testing can be used to validate vulnerabilities or determine the degree of penetration resistance of systems to adversaries within specified constraints. Such constraints include time, resources, and skills. Penetration testing attempts to duplicate the actions of adversaries and provides a more in-depth analysis of security- and privacy-related weaknesses or deficiencies. Penetration testing is especially important when organizations are transitioning from older technologies to newer technologies (e.g., transitioning from IPv4 to IPv6 network protocols).\n\nOrganizations can use the results of vulnerability analyses to support penetration testing activities. Penetration testing can be conducted internally or externally on the hardware, software, or firmware components of a system and can exercise both physical and technical controls. A standard method for penetration testing includes a pretest analysis based on full knowledge of the system, pretest identification of potential vulnerabilities based on the pretest analysis, and testing designed to determine the exploitability of vulnerabilities. All parties agree to the rules of engagement before commencing penetration testing scenarios. Organizations correlate the rules of engagement for the penetration tests with the tools, techniques, and procedures that are anticipated to be employed by adversaries. Penetration testing may result in the exposure of information that is protected by laws or regulations, to individuals conducting the testing. Rules of engagement, contracts, or other appropriate mechanisms can be used to communicate expectations for how to protect this information. Risk assessments guide the decisions on the level of independence required for the personnel conducting penetration testing.",
    "group": "Assessment, Authorization, and Monitoring",
    "parent_id": "ca",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ca-9",
    "label": "CA-09",
    "title": "Internal System Connections",
    "text": "Internal System Connections\nAuthorize internal connections of {{ insert: param, ca-09_odp.01 }} to the system;\nDocument, for each internal connection, the interface characteristics, security and privacy requirements, and the nature of the information communicated;\nTerminate internal system connections after {{ insert: param, ca-09_odp.02 }} ; and\nReview {{ insert: param, ca-09_odp.03 }} the continued need for each internal connection.\nInternal system connections are connections between organizational systems and separate constituent system components (i.e., connections between components that are part of the same system) including components used for system development. Intra-system connections include connections with mobile devices, notebook and desktop computers, tablets, printers, copiers, facsimile machines, scanners, sensors, and servers. Instead of authorizing each internal system connection individually, organizations can authorize internal connections for a class of system components with common characteristics and/or configurations, including printers, scanners, and copiers with a specified processing, transmission, and storage capability or smart phones and tablets with a specific baseline configuration. The continued need for an internal system connection is reviewed from the perspective of whether it provides support for organizational missions or business functions.",
    "group": "Assessment, Authorization, and Monitoring",
    "parent_id": "ca",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "cm-1",
    "label": "CM-01",
    "title": "Policy and Procedures",
    "text": "Policy and Procedures\nDevelop, document, and disseminate to {{ insert: param, cm-1_prm_1 }}:\nDesignate an {{ insert: param, cm-01_odp.04 }} to manage the development, documentation, and dissemination of the configuration management policy and procedures; and\nReview and update the current configuration management:\nConfiguration management policy and procedures address the controls in the CM family that are implemented within systems and organizations. The risk management strategy is an important factor in establishing such policies and procedures. Policies and procedures contribute to security and privacy assurance. Therefore, it is important that security and privacy programs collaborate on the development of configuration management policy and procedures. Security and privacy program policies and procedures at the organization level are preferable, in general, and may obviate the need for mission- or system-specific policies and procedures. The policy can be included as part of the general security and privacy policy or be represented by multiple policies that reflect the complex nature of organizations. Procedures can be established for security and privacy programs, for mission/business processes, and for systems, if needed. Procedures describe how the policies or controls are implemented and can be directed at the individual or role that is the object of the procedure. Procedures can be documented in system security and privacy plans or in one or more separate documents. Events that may precipitate an update to configuration management policy and procedures include, but are not limited to, assessment or audit findings, security incidents or breaches, or changes in applicable laws, executive orders, directives, regulations, policies, standards, and guidelines. Simply restating controls does not constitute an organizational policy or procedure.",
    "group": "Configuration Management",
    "parent_id": "cm",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "cm-2",
    "label": "CM-02",
    "title": "Baseline Configuration",
    "text": "Baseline Configuration\nDevelop, document, and maintain under configuration control, a current baseline configuration of the system; and\nReview and update the baseline configuration of the system:\nBaseline configurations for systems and system components include connectivity, operational, and communications aspects of systems. Baseline configurations are documented, formally reviewed, and agreed-upon specifications for systems or configuration items within those systems. Baseline configurations serve as a basis for future builds, releases, or changes to systems and include security and privacy control implementations, operational procedures, information about system components, network topology, and logical placement of components in the system architecture. Maintaining baseline configurations requires creating new baselines as organizational systems change over time. Baseline configurations of systems reflect the current enterprise architecture.",
    "group": "Configuration Management",
    "parent_id": "cm",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "cm-4",
    "label": "CM-04",
    "title": "Impact Analyses",
    "text": "Impact Analyses\nAnalyze changes to the system to determine potential security and privacy impacts prior to change implementation.\nOrganizational personnel with security or privacy responsibilities conduct impact analyses. Individuals conducting impact analyses possess the necessary skills and technical expertise to analyze the changes to systems as well as the security or privacy ramifications. Impact analyses include reviewing security and privacy plans, policies, and procedures to understand control requirements; reviewing system design documentation and operational procedures to understand control implementation and how specific system changes might affect the controls; reviewing the impact of changes on organizational supply chain partners with stakeholders; and determining how potential changes to a system create new risks to the privacy of individuals and the ability of implemented controls to mitigate those risks. Impact analyses also include risk assessments to understand the impact of the changes and determine if additional controls are required.",
    "group": "Configuration Management",
    "parent_id": "cm",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "cm-5",
    "label": "CM-05",
    "title": "Access Restrictions for Change",
    "text": "Access Restrictions for Change\nDefine, document, approve, and enforce physical and logical access restrictions associated with changes to the system.\nChanges to the hardware, software, or firmware components of systems or the operational procedures related to the system can potentially have significant effects on the security of the systems or individuals’ privacy. Therefore, organizations permit only qualified and authorized individuals to access systems for purposes of initiating changes. Access restrictions include physical and logical access controls (see [AC-3](#ac-3) and [PE-3](#pe-3) ), software libraries, workflow automation, media libraries, abstract layers (i.e., changes implemented into external interfaces rather than directly into systems), and change windows (i.e., changes occur only during specified times).",
    "group": "Configuration Management",
    "parent_id": "cm",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "cm-6",
    "label": "CM-06",
    "title": "Configuration Settings",
    "text": "Configuration Settings\nEstablish and document configuration settings for components employed within the system that reflect the most restrictive mode consistent with operational requirements using {{ insert: param, cm-06_odp.01 }};\nImplement the configuration settings;\nIdentify, document, and approve any deviations from established configuration settings for {{ insert: param, cm-06_odp.02 }} based on {{ insert: param, cm-06_odp.03 }} ; and\nMonitor and control changes to the configuration settings in accordance with organizational policies and procedures.\nConfiguration settings are the parameters that can be changed in the hardware, software, or firmware components of the system that affect the security and privacy posture or functionality of the system. Information technology products for which configuration settings can be defined include mainframe computers, servers, workstations, operating systems, mobile devices, input/output devices, protocols, and applications. Parameters that impact the security posture of systems include registry settings; account, file, or directory permission settings; and settings for functions, protocols, ports, services, and remote connections. Privacy parameters are parameters impacting the privacy posture of systems, including the parameters required to satisfy other privacy controls. Privacy parameters include settings for access controls, data processing preferences, and processing and retention permissions. Organizations establish organization-wide configuration settings and subsequently derive specific configuration settings for systems. The established settings become part of the configuration baseline for the system.\n\nCommon secure configurations (also known as security configuration checklists, lockdown and hardening guides, and security reference guides) provide recognized, standardized, and established benchmarks that stipulate secure configuration settings for information technology products and platforms as well as instructions for configuring those products or platforms to meet operational requirements. Common secure configurations can be developed by a variety of organizations, including information technology product developers, manufacturers, vendors, federal agencies, consortia, academia, industry, and other organizations in the public and private sectors.\n\nImplementation of a common secure configuration may be mandated at the organization level, mission and business process level, system level, or at a higher level, including by a regulatory agency. Common secure configurations include the United States Government Configuration Baseline [USGCB](#98498928-3ca3-44b3-8b1e-f48685373087) and security technical implementation guides (STIGs), which affect the implementation of [CM-6](#cm-6) and other controls such as [AC-19](#ac-19) and [CM-7](#cm-7) . The Security Content Automation Protocol (SCAP) and the defined standards within the protocol provide an effective method to uniquely identify, track, and control configuration settings.",
    "group": "Configuration Management",
    "parent_id": "cm",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "cm-7",
    "label": "CM-07",
    "title": "Least Functionality",
    "text": "Least Functionality\nConfigure the system to provide only {{ insert: param, cm-07_odp.01 }} ; and\nProhibit or restrict the use of the following functions, ports, protocols, software, and/or services: {{ insert: param, cm-7_prm_2 }}.\nSystems provide a wide variety of functions and services. Some of the functions and services routinely provided by default may not be necessary to support essential organizational missions, functions, or operations. Additionally, it is sometimes convenient to provide multiple services from a single system component, but doing so increases risk over limiting the services provided by that single component. Where feasible, organizations limit component functionality to a single function per component. Organizations consider removing unused or unnecessary software and disabling unused or unnecessary physical and logical ports and protocols to prevent unauthorized connection of components, transfer of information, and tunneling. Organizations employ network scanning tools, intrusion detection and prevention systems, and end-point protection technologies, such as firewalls and host-based intrusion detection systems, to identify and prevent the use of prohibited functions, protocols, ports, and services. Least functionality can also be achieved as part of the fundamental design and development of the system (see [SA-8](#sa-8), [SC-2](#sc-2) , and [SC-3](#sc-3)).",
    "group": "Configuration Management",
    "parent_id": "cm",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "cm-8",
    "label": "CM-08",
    "title": "System Component Inventory",
    "text": "System Component Inventory\nDevelop and document an inventory of system components that:\nReview and update the system component inventory {{ insert: param, cm-08_odp.02 }}.\nSystem components are discrete, identifiable information technology assets that include hardware, software, and firmware. Organizations may choose to implement centralized system component inventories that include components from all organizational systems. In such situations, organizations ensure that the inventories include system-specific information required for component accountability. The information necessary for effective accountability of system components includes the system name, software owners, software version numbers, hardware inventory specifications, software license information, and for networked components, the machine names and network addresses across all implemented protocols (e.g., IPv4, IPv6). Inventory specifications include date of receipt, cost, model, serial number, manufacturer, supplier information, component type, and physical location.\n\nPreventing duplicate accounting of system components addresses the lack of accountability that occurs when component ownership and system association is not known, especially in large or complex connected systems. Effective prevention of duplicate accounting of system components necessitates use of a unique identifier for each component. For software inventory, centrally managed software that is accessed via other systems is addressed as a component of the system on which it is installed and managed. Software installed on multiple organizational systems and managed at the system level is addressed for each individual system and may appear more than once in a centralized component inventory, necessitating a system association for each software instance in the centralized inventory to avoid duplicate accounting of components. Scanning systems implementing multiple network protocols (e.g., IPv4 and IPv6) can result in duplicate components being identified in different address spaces. The implementation of [CM-8(7)](#cm-8.7) can help to eliminate duplicate accounting of components.",
    "group": "Configuration Management",
    "parent_id": "cm",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "cm-10",
    "label": "CM-10",
    "title": "Software Usage Restrictions",
    "text": "Software Usage Restrictions\nUse software and associated documentation in accordance with contract agreements and copyright laws;\nTrack the use of software and associated documentation protected by quantity licenses to control copying and distribution; and\nControl and document the use of peer-to-peer file sharing technology to ensure that this capability is not used for the unauthorized distribution, display, performance, or reproduction of copyrighted work.\nSoftware license tracking can be accomplished by manual or automated methods, depending on organizational needs. Examples of contract agreements include software license agreements and non-disclosure agreements.",
    "group": "Configuration Management",
    "parent_id": "cm",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "cm-11",
    "label": "CM-11",
    "title": "User-installed Software",
    "text": "User-installed Software\nEstablish {{ insert: param, cm-11_odp.01 }} governing the installation of software by users;\nEnforce software installation policies through the following methods: {{ insert: param, cm-11_odp.02 }} ; and\nMonitor policy compliance {{ insert: param, cm-11_odp.03 }}.\nIf provided the necessary privileges, users can install software in organizational systems. To maintain control over the software installed, organizations identify permitted and prohibited actions regarding software installation. Permitted software installations include updates and security patches to existing software and downloading new applications from organization-approved \"app stores.\" Prohibited software installations include software with unknown or suspect pedigrees or software that organizations consider potentially malicious. Policies selected for governing user-installed software are organization-developed or provided by some external entity. Policy enforcement methods can include procedural methods and automated methods.",
    "group": "Configuration Management",
    "parent_id": "cm",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "cp-1",
    "label": "CP-01",
    "title": "Policy and Procedures",
    "text": "Policy and Procedures\nDevelop, document, and disseminate to {{ insert: param, cp-1_prm_1 }}:\nDesignate an {{ insert: param, cp-01_odp.04 }} to manage the development, documentation, and dissemination of the contingency planning policy and procedures; and\nReview and update the current contingency planning:\nContingency planning policy and procedures address the controls in the CP family that are implemented within systems and organizations. The risk management strategy is an important factor in establishing such policies and procedures. Policies and procedures contribute to security and privacy assurance. Therefore, it is important that security and privacy programs collaborate on the development of contingency planning policy and procedures. Security and privacy program policies and procedures at the organization level are preferable, in general, and may obviate the need for mission- or system-specific policies and procedures. The policy can be included as part of the general security and privacy policy or be represented by multiple policies that reflect the complex nature of organizations. Procedures can be established for security and privacy programs, for mission or business processes, and for systems, if needed. Procedures describe how the policies or controls are implemented and can be directed at the individual or role that is the object of the procedure. Procedures can be documented in system security and privacy plans or in one or more separate documents. Events that may precipitate an update to contingency planning policy and procedures include assessment or audit findings, security incidents or breaches, or changes in laws, executive orders, directives, regulations, policies, standards, and guidelines. Simply restating controls does not constitute an organizational policy or procedure.",
    "group": "Contingency Planning",
    "parent_id": "cp",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "cp-2",
    "label": "CP-02",
    "title": "Contingency Plan",
    "text": "Contingency Plan\nDevelop a contingency plan for the system that:\nDistribute copies of the contingency plan to {{ insert: param, cp-2_prm_2 }};\nCoordinate contingency planning activities with incident handling activities;\nReview the contingency plan for the system {{ insert: param, cp-02_odp.05 }};\nUpdate the contingency plan to address changes to the organization, system, or environment of operation and problems encountered during contingency plan implementation, execution, or testing;\nCommunicate contingency plan changes to {{ insert: param, cp-2_prm_4 }};\nIncorporate lessons learned from contingency plan testing, training, or actual contingency activities into contingency testing and training; and\nProtect the contingency plan from unauthorized disclosure and modification.\nContingency planning for systems is part of an overall program for achieving continuity of operations for organizational mission and business functions. Contingency planning addresses system restoration and implementation of alternative mission or business processes when systems are compromised or breached. Contingency planning is considered throughout the system development life cycle and is a fundamental part of the system design. Systems can be designed for redundancy, to provide backup capabilities, and for resilience. Contingency plans reflect the degree of restoration required for organizational systems since not all systems need to fully recover to achieve the level of continuity of operations desired. System recovery objectives reflect applicable laws, executive orders, directives, regulations, policies, standards, guidelines, organizational risk tolerance, and system impact level.\n\nActions addressed in contingency plans include orderly system degradation, system shutdown, fallback to a manual mode, alternate information flows, and operating in modes reserved for when systems are under attack. By coordinating contingency planning with incident handling activities, organizations ensure that the necessary planning activities are in place and activated in the event of an incident. Organizations consider whether continuity of operations during an incident conflicts with the capability to automatically disable the system, as specified in [IR-4(5)](#ir-4.5) . Incident response planning is part of contingency planning for organizations and is addressed in the [IR](#ir) (Incident Response) family.",
    "group": "Contingency Planning",
    "parent_id": "cp",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "cp-3",
    "label": "CP-03",
    "title": "Contingency Training",
    "text": "Contingency Training\nProvide contingency training to system users consistent with assigned roles and responsibilities:\nReview and update contingency training content {{ insert: param, cp-03_odp.03 }} and following {{ insert: param, cp-03_odp.04 }}.\nContingency training provided by organizations is linked to the assigned roles and responsibilities of organizational personnel to ensure that the appropriate content and level of detail is included in such training. For example, some individuals may only need to know when and where to report for duty during contingency operations and if normal duties are affected; system administrators may require additional training on how to establish systems at alternate processing and storage sites; and organizational officials may receive more specific training on how to conduct mission-essential functions in designated off-site locations and how to establish communications with other governmental entities for purposes of coordination on contingency-related activities. Training for contingency roles or responsibilities reflects the specific continuity requirements in the contingency plan. Events that may precipitate an update to contingency training content include, but are not limited to, contingency plan testing or an actual contingency (lessons learned), assessment or audit findings, security incidents or breaches, or changes in laws, executive orders, directives, regulations, policies, standards, and guidelines. At the discretion of the organization, participation in a contingency plan test or exercise, including lessons learned sessions subsequent to the test or exercise, may satisfy contingency plan training requirements.",
    "group": "Contingency Planning",
    "parent_id": "cp",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "cp-4",
    "label": "CP-04",
    "title": "Contingency Plan Testing",
    "text": "Contingency Plan Testing\nTest the contingency plan for the system {{ insert: param, cp-04_odp.01 }} using the following tests to determine the effectiveness of the plan and the readiness to execute the plan: {{ insert: param, cp-4_prm_2 }}.\nReview the contingency plan test results; and\nInitiate corrective actions, if needed.\nMethods for testing contingency plans to determine the effectiveness of the plans and identify potential weaknesses include checklists, walk-through and tabletop exercises, simulations (parallel or full interrupt), and comprehensive exercises. Organizations conduct testing based on the requirements in contingency plans and include a determination of the effects on organizational operations, assets, and individuals due to contingency operations. Organizations have flexibility and discretion in the breadth, depth, and timelines of corrective actions.",
    "group": "Contingency Planning",
    "parent_id": "cp",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "cp-9",
    "label": "CP-09",
    "title": "System Backup",
    "text": "System Backup\nConduct backups of user-level information contained in {{ insert: param, cp-09_odp.01 }} {{ insert: param, cp-09_odp.02 }};\nConduct backups of system-level information contained in the system {{ insert: param, cp-09_odp.03 }};\nConduct backups of system documentation, including security- and privacy-related documentation {{ insert: param, cp-09_odp.04 }} ; and\nProtect the confidentiality, integrity, and availability of backup information.\nSystem-level information includes system state information, operating system software, middleware, application software, and licenses. User-level information includes information other than system-level information. Mechanisms employed to protect the integrity of system backups include digital signatures and cryptographic hashes. Protection of system backup information while in transit is addressed by [MP-5](#mp-5) and [SC-8](#sc-8) . System backups reflect the requirements in contingency plans as well as other organizational requirements for backing up information. Organizations may be subject to laws, executive orders, directives, regulations, or policies with requirements regarding specific categories of information (e.g., personal health information). Organizational personnel consult with the senior agency official for privacy and legal counsel regarding such requirements.",
    "group": "Contingency Planning",
    "parent_id": "cp",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "cp-10",
    "label": "CP-10",
    "title": "System Recovery and Reconstitution",
    "text": "System Recovery and Reconstitution\nProvide for the recovery and reconstitution of the system to a known state within {{ insert: param, cp-10_prm_1 }} after a disruption, compromise, or failure.\nRecovery is executing contingency plan activities to restore organizational mission and business functions. Reconstitution takes place following recovery and includes activities for returning systems to fully operational states. Recovery and reconstitution operations reflect mission and business priorities; recovery point, recovery time, and reconstitution objectives; and organizational metrics consistent with contingency plan requirements. Reconstitution includes the deactivation of interim system capabilities that may have been needed during recovery operations. Reconstitution also includes assessments of fully restored system capabilities, reestablishment of continuous monitoring activities, system reauthorization (if required), and activities to prepare the system and organization for future disruptions, breaches, compromises, or failures. Recovery and reconstitution capabilities can include automated mechanisms and manual procedures. Organizations establish recovery time and recovery point objectives as part of contingency planning.",
    "group": "Contingency Planning",
    "parent_id": "cp",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ia-1",
    "label": "IA-01",
    "title": "Policy and Procedures",
    "text": "Policy and Procedures\nDevelop, document, and disseminate to {{ insert: param, ia-1_prm_1 }}:\nDesignate an {{ insert: param, ia-01_odp.04 }} to manage the development, documentation, and dissemination of the identification and authentication policy and procedures; and\nReview and update the current identification and authentication:\nIdentification and authentication policy and procedures address the controls in the IA family that are implemented within systems and organizations. The risk management strategy is an important factor in establishing such policies and procedures. Policies and procedures contribute to security and privacy assurance. Therefore, it is important that security and privacy programs collaborate on the development of identification and authentication policy and procedures. Security and privacy program policies and procedures at the organization level are preferable, in general, and may obviate the need for mission- or system-specific policies and procedures. The policy can be included as part of the general security and privacy policy or be represented by multiple policies that reflect the complex nature of organizations. Procedures can be established for security and privacy programs, for mission or business processes, and for systems, if needed. Procedures describe how the policies or controls are implemented and can be directed at the individual or role that is the object of the procedure. Procedures can be documented in system security and privacy plans or in one or more separate documents. Events that may precipitate an update to identification and authentication policy and procedures include assessment or audit findings, security incidents or breaches, or changes in applicable laws, executive orders, directives, regulations, policies, standards, and guidelines. Simply restating controls does not constitute an organizational policy or procedure.",
    "group": "Identification and Authentication",
    "parent_id": "ia",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ia-2",
    "label": "IA-02",
    "title": "Identification and Authentication (Organizational Users)",
    "text": "Identification and Authentication (Organizational Users)\nUniquely identify and authenticate organizational users and associate that unique identification with processes acting on behalf of those users.\nOrganizations can satisfy the identification and authentication requirements by complying with the requirements in [HSPD 12](#f16e438e-7114-4144-bfe2-2dfcad8cb2d0) . Organizational users include employees or individuals who organizations consider to have an equivalent status to employees (e.g., contractors and guest researchers). Unique identification and authentication of users applies to all accesses other than those that are explicitly identified in [AC-14](#ac-14) and that occur through the authorized use of group authenticators without individual authentication. Since processes execute on behalf of groups and roles, organizations may require unique identification of individuals in group accounts or for detailed accountability of individual activity.\n\nOrganizations employ passwords, physical authenticators, or biometrics to authenticate user identities or, in the case of multi-factor authentication, some combination thereof. Access to organizational systems is defined as either local access or network access. Local access is any access to organizational systems by users or processes acting on behalf of users, where access is obtained through direct connections without the use of networks. Network access is access to organizational systems by users (or processes acting on behalf of users) where access is obtained through network connections (i.e., nonlocal accesses). Remote access is a type of network access that involves communication through external networks. Internal networks include local area networks and wide area networks.\n\nThe use of encrypted virtual private networks for network connections between organization-controlled endpoints and non-organization-controlled endpoints may be treated as internal networks with respect to protecting the confidentiality and integrity of information traversing the network. Identification and authentication requirements for non-organizational users are described in [IA-8](#ia-8).",
    "group": "Identification and Authentication",
    "parent_id": "ia",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ia-2.1",
    "label": "IA-02(01)",
    "title": "Multi-factor Authentication to Privileged Accounts",
    "text": "Multi-factor Authentication to Privileged Accounts\nImplement multi-factor authentication for access to privileged accounts.\nMulti-factor authentication requires the use of two or more different factors to achieve authentication. The authentication factors are defined as follows: something you know (e.g., a personal identification number [PIN]), something you have (e.g., a physical authenticator such as a cryptographic private key), or something you are (e.g., a biometric). Multi-factor authentication solutions that feature physical authenticators include hardware authenticators that provide time-based or challenge-response outputs and smart cards such as the U.S. Government Personal Identity Verification (PIV) card or the Department of Defense (DoD) Common Access Card (CAC). In addition to authenticating users at the system level (i.e., at logon), organizations may employ authentication mechanisms at the application level, at their discretion, to provide increased security. Regardless of the type of access (i.e., local, network, remote), privileged accounts are authenticated using multi-factor options appropriate for the level of risk. Organizations can add additional security measures, such as additional or more rigorous authentication mechanisms, for specific types of access.",
    "group": "Identification and Authentication",
    "parent_id": "ia-2",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ia-2.2",
    "label": "IA-02(02)",
    "title": "Multi-factor Authentication to Non-privileged Accounts",
    "text": "Multi-factor Authentication to Non-privileged Accounts\nImplement multi-factor authentication for access to non-privileged accounts.\nMulti-factor authentication requires the use of two or more different factors to achieve authentication. The authentication factors are defined as follows: something you know (e.g., a personal identification number [PIN]), something you have (e.g., a physical authenticator such as a cryptographic private key), or something you are (e.g., a biometric). Multi-factor authentication solutions that feature physical authenticators include hardware authenticators that provide time-based or challenge-response outputs and smart cards such as the U.S. Government Personal Identity Verification card or the DoD Common Access Card. In addition to authenticating users at the system level, organizations may also employ authentication mechanisms at the application level, at their discretion, to provide increased information security. Regardless of the type of access (i.e., local, network, remote), non-privileged accounts are authenticated using multi-factor options appropriate for the level of risk. Organizations can provide additional security measures, such as additional or more rigorous authentication mechanisms, for specific types of access.",
    "group": "Identification and Authentication",
    "parent_id": "ia-2",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ia-2.8",
    "label": "IA-02(08)",
    "title": "Access to Accounts — Replay Resistant",
    "text": "Access to Accounts — Replay Resistant\nImplement replay-resistant authentication mechanisms for access to {{ insert: param, ia-02.08_odp }}.\nAuthentication processes resist replay attacks if it is impractical to achieve successful authentications by replaying previous authentication messages. Replay-resistant techniques include protocols that use nonces or challenges such as time synchronous or cryptographic authenticators.",
    "group": "Identification and Authentication",
    "parent_id": "ia-2",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ia-2.12",
    "label": "IA-02(12)",
    "title": "Acceptance of PIV Credentials",
    "text": "Acceptance of PIV Credentials\nAccept and electronically verify Personal Identity Verification-compliant credentials.\nAcceptance of Personal Identity Verification (PIV)-compliant credentials applies to organizations implementing logical access control and physical access control systems. PIV-compliant credentials are those credentials issued by federal agencies that conform to FIPS Publication 201 and supporting guidance documents. The adequacy and reliability of PIV card issuers are authorized using [SP 800-79-2](#10963761-58fc-4b20-b3d6-b44a54daba03) . Acceptance of PIV-compliant credentials includes derived PIV credentials, the use of which is addressed in [SP 800-166](#e8552d48-cf41-40aa-8b06-f45f7fb4706c) . The DOD Common Access Card (CAC) is an example of a PIV credential.",
    "group": "Identification and Authentication",
    "parent_id": "ia-2",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ia-4",
    "label": "IA-04",
    "title": "Identifier Management",
    "text": "Identifier Management\nManage system identifiers by:\nReceiving authorization from {{ insert: param, ia-04_odp.01 }} to assign an individual, group, role, service, or device identifier;\nSelecting an identifier that identifies an individual, group, role, service, or device;\nAssigning the identifier to the intended individual, group, role, service, or device; and\nPreventing reuse of identifiers for {{ insert: param, ia-04_odp.02 }}.\nCommon device identifiers include Media Access Control (MAC) addresses, Internet Protocol (IP) addresses, or device-unique token identifiers. The management of individual identifiers is not applicable to shared system accounts. Typically, individual identifiers are the usernames of the system accounts assigned to those individuals. In such instances, the account management activities of [AC-2](#ac-2) use account names provided by [IA-4](#ia-4) . Identifier management also addresses individual identifiers not necessarily associated with system accounts. Preventing the reuse of identifiers implies preventing the assignment of previously used individual, group, role, service, or device identifiers to different individuals, groups, roles, services, or devices.",
    "group": "Identification and Authentication",
    "parent_id": "ia",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ia-5",
    "label": "IA-05",
    "title": "Authenticator Management",
    "text": "Authenticator Management\nManage system authenticators by:\nVerifying, as part of the initial authenticator distribution, the identity of the individual, group, role, service, or device receiving the authenticator;\nEstablishing initial authenticator content for any authenticators issued by the organization;\nEnsuring that authenticators have sufficient strength of mechanism for their intended use;\nEstablishing and implementing administrative procedures for initial authenticator distribution, for lost or compromised or damaged authenticators, and for revoking authenticators;\nChanging default authenticators prior to first use;\nChanging or refreshing authenticators {{ insert: param, ia-05_odp.01 }} or when {{ insert: param, ia-05_odp.02 }} occur;\nProtecting authenticator content from unauthorized disclosure and modification;\nRequiring individuals to take, and having devices implement, specific controls to protect authenticators; and\nChanging authenticators for group or role accounts when membership to those accounts changes.\nAuthenticators include passwords, cryptographic devices, biometrics, certificates, one-time password devices, and ID badges. Device authenticators include certificates and passwords. Initial authenticator content is the actual content of the authenticator (e.g., the initial password). In contrast, the requirements for authenticator content contain specific criteria or characteristics (e.g., minimum password length). Developers may deliver system components with factory default authentication credentials (i.e., passwords) to allow for initial installation and configuration. Default authentication credentials are often well known, easily discoverable, and present a significant risk. The requirement to protect individual authenticators may be implemented via control [PL-4](#pl-4) or [PS-6](#ps-6) for authenticators in the possession of individuals and by controls [AC-3](#ac-3), [AC-6](#ac-6) , and [SC-28](#sc-28) for authenticators stored in organizational systems, including passwords stored in hashed or encrypted formats or files containing encrypted or hashed passwords accessible with administrator privileges.\n\nSystems support authenticator management by organization-defined settings and restrictions for various authenticator characteristics (e.g., minimum password length, validation time window for time synchronous one-time tokens, and number of allowed rejections during the verification stage of biometric authentication). Actions can be taken to safeguard individual authenticators, including maintaining possession of authenticators, not sharing authenticators with others, and immediately reporting lost, stolen, or compromised authenticators. Authenticator management includes issuing and revoking authenticators for temporary access when no longer needed.",
    "group": "Identification and Authentication",
    "parent_id": "ia",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ia-5.1",
    "label": "IA-05(01)",
    "title": "Password-based Authentication",
    "text": "Password-based Authentication\nFor password-based authentication:\nMaintain a list of commonly-used, expected, or compromised passwords and update the list {{ insert: param, ia-05.01_odp.01 }} and when organizational passwords are suspected to have been compromised directly or indirectly;\nVerify, when users create or update passwords, that the passwords are not found on the list of commonly-used, expected, or compromised passwords in IA-5(1)(a);\nTransmit passwords only over cryptographically-protected channels;\nStore passwords using an approved salted key derivation function, preferably using a keyed hash;\nRequire immediate selection of a new password upon account recovery;\nAllow user selection of long passwords and passphrases, including spaces and all printable characters;\nEmploy automated tools to assist the user in selecting strong password authenticators; and\nEnforce the following composition and complexity rules: {{ insert: param, ia-05.01_odp.02 }}.\nPassword-based authentication applies to passwords regardless of whether they are used in single-factor or multi-factor authentication. Long passwords or passphrases are preferable over shorter passwords. Enforced composition rules provide marginal security benefits while decreasing usability. However, organizations may choose to establish certain rules for password generation (e.g., minimum character length for long passwords) under certain circumstances and can enforce this requirement in IA-5(1)(h). Account recovery can occur, for example, in situations when a password is forgotten. Cryptographically protected passwords include salted one-way cryptographic hashes of passwords. The list of commonly used, compromised, or expected passwords includes passwords obtained from previous breach corpuses, dictionary words, and repetitive or sequential characters. The list includes context-specific words, such as the name of the service, username, and derivatives thereof.",
    "group": "Identification and Authentication",
    "parent_id": "ia-5",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ia-6",
    "label": "IA-06",
    "title": "Authentication Feedback",
    "text": "Authentication Feedback\nObscure feedback of authentication information during the authentication process to protect the information from possible exploitation and use by unauthorized individuals.\nAuthentication feedback from systems does not provide information that would allow unauthorized individuals to compromise authentication mechanisms. For some types of systems, such as desktops or notebooks with relatively large monitors, the threat (referred to as shoulder surfing) may be significant. For other types of systems, such as mobile devices with small displays, the threat may be less significant and is balanced against the increased likelihood of typographic input errors due to small keyboards. Thus, the means for obscuring authentication feedback is selected accordingly. Obscuring authentication feedback includes displaying asterisks when users type passwords into input devices or displaying feedback for a very limited time before obscuring it.",
    "group": "Identification and Authentication",
    "parent_id": "ia",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ia-7",
    "label": "IA-07",
    "title": "Cryptographic Module Authentication",
    "text": "Cryptographic Module Authentication\nImplement mechanisms for authentication to a cryptographic module that meet the requirements of applicable laws, executive orders, directives, policies, regulations, standards, and guidelines for such authentication.\nAuthentication mechanisms may be required within a cryptographic module to authenticate an operator accessing the module and to verify that the operator is authorized to assume the requested role and perform services within that role.",
    "group": "Identification and Authentication",
    "parent_id": "ia",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ia-8",
    "label": "IA-08",
    "title": "Identification and Authentication (Non-organizational Users)",
    "text": "Identification and Authentication (Non-organizational Users)\nUniquely identify and authenticate non-organizational users or processes acting on behalf of non-organizational users.\nNon-organizational users include system users other than organizational users explicitly covered by [IA-2](#ia-2) . Non-organizational users are uniquely identified and authenticated for accesses other than those explicitly identified and documented in [AC-14](#ac-14) . Identification and authentication of non-organizational users accessing federal systems may be required to protect federal, proprietary, or privacy-related information (with exceptions noted for national security systems). Organizations consider many factors—including security, privacy, scalability, and practicality—when balancing the need to ensure ease of use for access to federal information and systems with the need to protect and adequately mitigate risk.",
    "group": "Identification and Authentication",
    "parent_id": "ia",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ia-8.1",
    "label": "IA-08(01)",
    "title": "Acceptance of PIV Credentials from Other Agencies",
    "text": "Acceptance of PIV Credentials from Other Agencies\nAccept and electronically verify Personal Identity Verification-compliant credentials from other federal agencies.\nAcceptance of Personal Identity Verification (PIV) credentials from other federal agencies applies to both logical and physical access control systems. PIV credentials are those credentials issued by federal agencies that conform to FIPS Publication 201 and supporting guidelines. The adequacy and reliability of PIV card issuers are addressed and authorized using [SP 800-79-2](#10963761-58fc-4b20-b3d6-b44a54daba03).",
    "group": "Identification and Authentication",
    "parent_id": "ia-8",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ia-8.2",
    "label": "IA-08(02)",
    "title": "Acceptance of External Authenticators",
    "text": "Acceptance of External Authenticators\nAccept only external authenticators that are NIST-compliant; and\nDocument and maintain a list of accepted external authenticators.\nAcceptance of only NIST-compliant external authenticators applies to organizational systems that are accessible to the public (e.g., public-facing websites). External authenticators are issued by nonfederal government entities and are compliant with [SP 800-63B](#e59c5a7c-8b1f-49ca-8de0-6ee0882180ce) . Approved external authenticators meet or exceed the minimum Federal Government-wide technical, security, privacy, and organizational maturity requirements. Meeting or exceeding Federal requirements allows Federal Government relying parties to trust external authenticators in connection with an authentication transaction at a specified authenticator assurance level.",
    "group": "Identification and Authentication",
    "parent_id": "ia-8",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ia-8.4",
    "label": "IA-08(04)",
    "title": "Use of Defined Profiles",
    "text": "Use of Defined Profiles\nConform to the following profiles for identity management {{ insert: param, ia-08.04_odp }}.\nOrganizations define profiles for identity management based on open identity management standards. To ensure that open identity management standards are viable, robust, reliable, sustainable, and interoperable as documented, the Federal Government assesses and scopes the standards and technology implementations against applicable laws, executive orders, directives, policies, regulations, standards, and guidelines.",
    "group": "Identification and Authentication",
    "parent_id": "ia-8",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ia-11",
    "label": "IA-11",
    "title": "Re-authentication",
    "text": "Re-authentication\nRequire users to re-authenticate when {{ insert: param, ia-11_odp }}.\nIn addition to the re-authentication requirements associated with device locks, organizations may require re-authentication of individuals in certain situations, including when roles, authenticators or credentials change, when security categories of systems change, when the execution of privileged functions occurs, after a fixed time period, or periodically.",
    "group": "Identification and Authentication",
    "parent_id": "ia",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ir-1",
    "label": "IR-01",
    "title": "Policy and Procedures",
    "text": "Policy and Procedures\nDevelop, document, and disseminate to {{ insert: param, ir-1_prm_1 }}:\nDesignate an {{ insert: param, ir-01_odp.04 }} to manage the development, documentation, and dissemination of the incident response policy and procedures; and\nReview and update the current incident response:\nIncident response policy and procedures address the controls in the IR family that are implemented within systems and organizations. The risk management strategy is an important factor in establishing such policies and procedures. Policies and procedures contribute to security and privacy assurance. Therefore, it is important that security and privacy programs collaborate on the development of incident response policy and procedures. Security and privacy program policies and procedures at the organization level are preferable, in general, and may obviate the need for mission- or system-specific policies and procedures. The policy can be included as part of the general security and privacy policy or be represented by multiple policies that reflect the complex nature of organizations. Procedures can be established for security and privacy programs, for mission or business processes, and for systems, if needed. Procedures describe how the policies or controls are implemented and can be directed at the individual or role that is the object of the procedure. Procedures can be documented in system security and privacy plans or in one or more separate documents. Events that may precipitate an update to incident response policy and procedures include assessment or audit findings, security incidents or breaches, or changes in laws, executive orders, directives, regulations, policies, standards, and guidelines. Simply restating controls does not constitute an organizational policy or procedure.",
    "group": "Incident Response",
    "parent_id": "ir",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ir-2",
    "label": "IR-02",
    "title": "Incident Response Training",
    "text": "Incident Response Training\nProvide incident response training to system users consistent with assigned roles and responsibilities:\nReview and update incident response training content {{ insert: param, ir-02_odp.03 }} and following {{ insert: param, ir-02_odp.04 }}.\nIncident response training is associated with the assigned roles and responsibilities of organizational personnel to ensure that the appropriate content and level of detail are included in such training. For example, users may only need to know who to call or how to recognize an incident; system administrators may require additional training on how to handle incidents; and incident responders may receive more specific training on forensics, data collection techniques, reporting, system recovery, and system restoration. Incident response training includes user training in identifying and reporting suspicious activities from external and internal sources. Incident response training for users may be provided as part of [AT-2](#at-2) or [AT-3](#at-3) . Events that may precipitate an update to incident response training content include, but are not limited to, incident response plan testing or response to an actual incident (lessons learned), assessment or audit findings, or changes in applicable laws, executive orders, directives, regulations, policies, standards, and guidelines.",
    "group": "Incident Response",
    "parent_id": "ir",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ir-4",
    "label": "IR-04",
    "title": "Incident Handling",
    "text": "Incident Handling\nImplement an incident handling capability for incidents that is consistent with the incident response plan and includes preparation, detection and analysis, containment, eradication, and recovery;\nCoordinate incident handling activities with contingency planning activities;\nIncorporate lessons learned from ongoing incident handling activities into incident response procedures, training, and testing, and implement the resulting changes accordingly; and\nEnsure the rigor, intensity, scope, and results of incident handling activities are comparable and predictable across the organization.\nOrganizations recognize that incident response capabilities are dependent on the capabilities of organizational systems and the mission and business processes being supported by those systems. Organizations consider incident response as part of the definition, design, and development of mission and business processes and systems. Incident-related information can be obtained from a variety of sources, including audit monitoring, physical access monitoring, and network monitoring; user or administrator reports; and reported supply chain events. An effective incident handling capability includes coordination among many organizational entities (e.g., mission or business owners, system owners, authorizing officials, human resources offices, physical security offices, personnel security offices, legal departments, risk executive [function], operations personnel, procurement offices). Suspected security incidents include the receipt of suspicious email communications that can contain malicious code. Suspected supply chain incidents include the insertion of counterfeit hardware or malicious code into organizational systems or system components. For federal agencies, an incident that involves personally identifiable information is considered a breach. A breach results in unauthorized disclosure, the loss of control, unauthorized acquisition, compromise, or a similar occurrence where a person other than an authorized user accesses or potentially accesses personally identifiable information or an authorized user accesses or potentially accesses such information for other than authorized purposes.",
    "group": "Incident Response",
    "parent_id": "ir",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ir-5",
    "label": "IR-05",
    "title": "Incident Monitoring",
    "text": "Incident Monitoring\nTrack and document incidents.\nDocumenting incidents includes maintaining records about each incident, the status of the incident, and other pertinent information necessary for forensics as well as evaluating incident details, trends, and handling. Incident information can be obtained from a variety of sources, including network monitoring, incident reports, incident response teams, user complaints, supply chain partners, audit monitoring, physical access monitoring, and user and administrator reports. [IR-4](#ir-4) provides information on the types of incidents that are appropriate for monitoring.",
    "group": "Incident Response",
    "parent_id": "ir",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ir-6",
    "label": "IR-06",
    "title": "Incident Reporting",
    "text": "Incident Reporting\nRequire personnel to report suspected incidents to the organizational incident response capability within {{ insert: param, ir-06_odp.01 }} ; and\nReport incident information to {{ insert: param, ir-06_odp.02 }}.\nThe types of incidents reported, the content and timeliness of the reports, and the designated reporting authorities reflect applicable laws, executive orders, directives, regulations, policies, standards, and guidelines. Incident information can inform risk assessments, control effectiveness assessments, security requirements for acquisitions, and selection criteria for technology products.",
    "group": "Incident Response",
    "parent_id": "ir",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ir-7",
    "label": "IR-07",
    "title": "Incident Response Assistance",
    "text": "Incident Response Assistance\nProvide an incident response support resource, integral to the organizational incident response capability, that offers advice and assistance to users of the system for the handling and reporting of incidents.\nIncident response support resources provided by organizations include help desks, assistance groups, automated ticketing systems to open and track incident response tickets, and access to forensics services or consumer redress services, when required.",
    "group": "Incident Response",
    "parent_id": "ir",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ir-8",
    "label": "IR-08",
    "title": "Incident Response Plan",
    "text": "Incident Response Plan\nDevelop an incident response plan that:\nDistribute copies of the incident response plan to {{ insert: param, ir-08_odp.04 }};\nUpdate the incident response plan to address system and organizational changes or problems encountered during plan implementation, execution, or testing;\nCommunicate incident response plan changes to {{ insert: param, ir-8_prm_5 }} ; and\nProtect the incident response plan from unauthorized disclosure and modification.\nIt is important that organizations develop and implement a coordinated approach to incident response. Organizational mission and business functions determine the structure of incident response capabilities. As part of the incident response capabilities, organizations consider the coordination and sharing of information with external organizations, including external service providers and other organizations involved in the supply chain. For incidents involving personally identifiable information (i.e., breaches), include a process to determine whether notice to oversight organizations or affected individuals is appropriate and provide that notice accordingly.",
    "group": "Incident Response",
    "parent_id": "ir",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ma-1",
    "label": "MA-01",
    "title": "Policy and Procedures",
    "text": "Policy and Procedures\nDevelop, document, and disseminate to {{ insert: param, ma-1_prm_1 }}:\nDesignate an {{ insert: param, ma-01_odp.04 }} to manage the development, documentation, and dissemination of the maintenance policy and procedures; and\nReview and update the current maintenance:\nMaintenance policy and procedures address the controls in the MA family that are implemented within systems and organizations. The risk management strategy is an important factor in establishing such policies and procedures. Policies and procedures contribute to security and privacy assurance. Therefore, it is important that security and privacy programs collaborate on the development of maintenance policy and procedures. Security and privacy program policies and procedures at the organization level are preferable, in general, and may obviate the need for mission- or system-specific policies and procedures. The policy can be included as part of the general security and privacy policy or be represented by multiple policies that reflect the complex nature of organizations. Procedures can be established for security and privacy programs, for mission or business processes, and for systems, if needed. Procedures describe how the policies or controls are implemented and can be directed at the individual or role that is the object of the procedure. Procedures can be documented in system security and privacy plans or in one or more separate documents. Events that may precipitate an update to maintenance policy and procedures assessment or audit findings, security incidents or breaches, or changes in applicable laws, executive orders, directives, regulations, policies, standards, and guidelines. Simply restating controls does not constitute an organizational policy or procedure.",
    "group": "Maintenance",
    "parent_id": "ma",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ma-2",
    "label": "MA-02",
    "title": "Controlled Maintenance",
    "text": "Controlled Maintenance\nSchedule, document, and review records of maintenance, repair, and replacement on system components in accordance with manufacturer or vendor specifications and/or organizational requirements;\nApprove and monitor all maintenance activities, whether performed on site or remotely and whether the system or system components are serviced on site or removed to another location;\nRequire that {{ insert: param, ma-02_odp.01 }} explicitly approve the removal of the system or system components from organizational facilities for off-site maintenance, repair, or replacement;\nSanitize equipment to remove the following information from associated media prior to removal from organizational facilities for off-site maintenance, repair, or replacement: {{ insert: param, ma-02_odp.02 }};\nCheck all potentially impacted controls to verify that the controls are still functioning properly following maintenance, repair, or replacement actions; and\nInclude the following information in organizational maintenance records: {{ insert: param, ma-02_odp.03 }}.\nControlling system maintenance addresses the information security aspects of the system maintenance program and applies to all types of maintenance to system components conducted by local or nonlocal entities. Maintenance includes peripherals such as scanners, copiers, and printers. Information necessary for creating effective maintenance records includes the date and time of maintenance, a description of the maintenance performed, names of the individuals or group performing the maintenance, name of the escort, and system components or equipment that are removed or replaced. Organizations consider supply chain-related risks associated with replacement components for systems.",
    "group": "Maintenance",
    "parent_id": "ma",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ma-4",
    "label": "MA-04",
    "title": "Nonlocal Maintenance",
    "text": "Nonlocal Maintenance\nApprove and monitor nonlocal maintenance and diagnostic activities;\nAllow the use of nonlocal maintenance and diagnostic tools only as consistent with organizational policy and documented in the security plan for the system;\nEmploy strong authentication in the establishment of nonlocal maintenance and diagnostic sessions;\nMaintain records for nonlocal maintenance and diagnostic activities; and\nTerminate session and network connections when nonlocal maintenance is completed.\nNonlocal maintenance and diagnostic activities are conducted by individuals who communicate through either an external or internal network. Local maintenance and diagnostic activities are carried out by individuals who are physically present at the system location and not communicating across a network connection. Authentication techniques used to establish nonlocal maintenance and diagnostic sessions reflect the network access requirements in [IA-2](#ia-2) . Strong authentication requires authenticators that are resistant to replay attacks and employ multi-factor authentication. Strong authenticators include PKI where certificates are stored on a token protected by a password, passphrase, or biometric. Enforcing requirements in [MA-4](#ma-4) is accomplished, in part, by other controls. [SP 800-63B](#e59c5a7c-8b1f-49ca-8de0-6ee0882180ce) provides additional guidance on strong authentication and authenticators.",
    "group": "Maintenance",
    "parent_id": "ma",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ma-5",
    "label": "MA-05",
    "title": "Maintenance Personnel",
    "text": "Maintenance Personnel\nEstablish a process for maintenance personnel authorization and maintain a list of authorized maintenance organizations or personnel;\nVerify that non-escorted personnel performing maintenance on the system possess the required access authorizations; and\nDesignate organizational personnel with required access authorizations and technical competence to supervise the maintenance activities of personnel who do not possess the required access authorizations.\nMaintenance personnel refers to individuals who perform hardware or software maintenance on organizational systems, while [PE-2](#pe-2) addresses physical access for individuals whose maintenance duties place them within the physical protection perimeter of the systems. Technical competence of supervising individuals relates to the maintenance performed on the systems, while having required access authorizations refers to maintenance on and near the systems. Individuals not previously identified as authorized maintenance personnel—such as information technology manufacturers, vendors, systems integrators, and consultants—may require privileged access to organizational systems, such as when they are required to conduct maintenance activities with little or no notice. Based on organizational assessments of risk, organizations may issue temporary credentials to these individuals. Temporary credentials may be for one-time use or for very limited time periods.",
    "group": "Maintenance",
    "parent_id": "ma",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "mp-1",
    "label": "MP-01",
    "title": "Policy and Procedures",
    "text": "Policy and Procedures\nDevelop, document, and disseminate to {{ insert: param, mp-1_prm_1 }}:\nDesignate an {{ insert: param, mp-01_odp.04 }} to manage the development, documentation, and dissemination of the media protection policy and procedures; and\nReview and update the current media protection:\nMedia protection policy and procedures address the controls in the MP family that are implemented within systems and organizations. The risk management strategy is an important factor in establishing such policies and procedures. Policies and procedures contribute to security and privacy assurance. Therefore, it is important that security and privacy programs collaborate on the development of media protection policy and procedures. Security and privacy program policies and procedures at the organization level are preferable, in general, and may obviate the need for mission- or system-specific policies and procedures. The policy can be included as part of the general security and privacy policy or be represented by multiple policies that reflect the complex nature of organizations. Procedures can be established for security and privacy programs, for mission or business processes, and for systems, if needed. Procedures describe how the policies or controls are implemented and can be directed at the individual or role that is the object of the procedure. Procedures can be documented in system security and privacy plans or in one or more separate documents. Events that may precipitate an update to media protection policy and procedures include assessment or audit findings, security incidents or breaches, or changes in applicable laws, executive orders, directives, regulations, policies, standards, and guidelines. Simply restating controls does not constitute an organizational policy or procedure.",
    "group": "Media Protection",
    "parent_id": "mp",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "mp-2",
    "label": "MP-02",
    "title": "Media Access",
    "text": "Media Access\nRestrict access to {{ insert: param, mp-2_prm_1 }} to {{ insert: param, mp-2_prm_2 }}.\nSystem media includes digital and non-digital media. Digital media includes flash drives, diskettes, magnetic tapes, external or removable hard disk drives (e.g., solid state, magnetic), compact discs, and digital versatile discs. Non-digital media includes paper and microfilm. Denying access to patient medical records in a community hospital unless the individuals seeking access to such records are authorized healthcare providers is an example of restricting access to non-digital media. Limiting access to the design specifications stored on compact discs in the media library to individuals on the system development team is an example of restricting access to digital media.",
    "group": "Media Protection",
    "parent_id": "mp",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "mp-6",
    "label": "MP-06",
    "title": "Media Sanitization",
    "text": "Media Sanitization\nSanitize {{ insert: param, mp-6_prm_1 }} prior to disposal, release out of organizational control, or release for reuse using {{ insert: param, mp-6_prm_2 }} ; and\nEmploy sanitization mechanisms with the strength and integrity commensurate with the security category or classification of the information.\nMedia sanitization applies to all digital and non-digital system media subject to disposal or reuse, whether or not the media is considered removable. Examples include digital media in scanners, copiers, printers, notebook computers, workstations, network components, mobile devices, and non-digital media (e.g., paper and microfilm). The sanitization process removes information from system media such that the information cannot be retrieved or reconstructed. Sanitization techniques—including clearing, purging, cryptographic erase, de-identification of personally identifiable information, and destruction—prevent the disclosure of information to unauthorized individuals when such media is reused or released for disposal. Organizations determine the appropriate sanitization methods, recognizing that destruction is sometimes necessary when other methods cannot be applied to media requiring sanitization. Organizations use discretion on the employment of approved sanitization techniques and procedures for media that contains information deemed to be in the public domain or publicly releasable or information deemed to have no adverse impact on organizations or individuals if released for reuse or disposal. Sanitization of non-digital media includes destruction, removing a classified appendix from an otherwise unclassified document, or redacting selected sections or words from a document by obscuring the redacted sections or words in a manner equivalent in effectiveness to removing them from the document. NSA standards and policies control the sanitization process for media that contains classified information. NARA policies control the sanitization process for controlled unclassified information.",
    "group": "Media Protection",
    "parent_id": "mp",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "mp-7",
    "label": "MP-07",
    "title": "Media Use",
    "text": "Media Use\n{{ insert: param, mp-07_odp.02 }} the use of {{ insert: param, mp-07_odp.01 }} on {{ insert: param, mp-07_odp.03 }} using {{ insert: param, mp-07_odp.04 }} ; and\nProhibit the use of portable storage devices in organizational systems when such devices have no identifiable owner.\nSystem media includes both digital and non-digital media. Digital media includes diskettes, magnetic tapes, flash drives, compact discs, digital versatile discs, and removable hard disk drives. Non-digital media includes paper and microfilm. Media use protections also apply to mobile devices with information storage capabilities. In contrast to [MP-2](#mp-2) , which restricts user access to media, MP-7 restricts the use of certain types of media on systems, for example, restricting or prohibiting the use of flash drives or external hard disk drives. Organizations use technical and nontechnical controls to restrict the use of system media. Organizations may restrict the use of portable storage devices, for example, by using physical cages on workstations to prohibit access to certain external ports or disabling or removing the ability to insert, read, or write to such devices. Organizations may also limit the use of portable storage devices to only approved devices, including devices provided by the organization, devices provided by other approved organizations, and devices that are not personally owned. Finally, organizations may restrict the use of portable storage devices based on the type of device, such as by prohibiting the use of writeable, portable storage devices and implementing this restriction by disabling or removing the capability to write to such devices. Requiring identifiable owners for storage devices reduces the risk of using such devices by allowing organizations to assign responsibility for addressing known vulnerabilities in the devices.",
    "group": "Media Protection",
    "parent_id": "mp",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "pe-1",
    "label": "PE-01",
    "title": "Policy and Procedures",
    "text": "Policy and Procedures\nDevelop, document, and disseminate to {{ insert: param, pe-1_prm_1 }}:\nDesignate an {{ insert: param, pe-01_odp.04 }} to manage the development, documentation, and dissemination of the physical and environmental protection policy and procedures; and\nReview and update the current physical and environmental protection:\nPhysical and environmental protection policy and procedures address the controls in the PE family that are implemented within systems and organizations. The risk management strategy is an important factor in establishing such policies and procedures. Policies and procedures contribute to security and privacy assurance. Therefore, it is important that security and privacy programs collaborate on the development of physical and environmental protection policy and procedures. Security and privacy program policies and procedures at the organization level are preferable, in general, and may obviate the need for mission- or system-specific policies and procedures. The policy can be included as part of the general security and privacy policy or be represented by multiple policies that reflect the complex nature of organizations. Procedures can be established for security and privacy programs, for mission or business processes, and for systems, if needed. Procedures describe how the policies or controls are implemented and can be directed at the individual or role that is the object of the procedure. Procedures can be documented in system security and privacy plans or in one or more separate documents. Events that may precipitate an update to physical and environmental protection policy and procedures include assessment or audit findings, security incidents or breaches, or changes in applicable laws, executive orders, directives, regulations, policies, standards, and guidelines. Simply restating controls does not constitute an organizational policy or procedure.",
    "group": "Physical and Environmental Protection",
    "parent_id": "pe",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "pe-2",
    "label": "PE-02",
    "title": "Physical Access Authorizations",
    "text": "Physical Access Authorizations\nDevelop, approve, and maintain a list of individuals with authorized access to the facility where the system resides;\nIssue authorization credentials for facility access;\nReview the access list detailing authorized facility access by individuals {{ insert: param, pe-02_odp }} ; and\nRemove individuals from the facility access list when access is no longer required.\nPhysical access authorizations apply to employees and visitors. Individuals with permanent physical access authorization credentials are not considered visitors. Authorization credentials include ID badges, identification cards, and smart cards. Organizations determine the strength of authorization credentials needed consistent with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines. Physical access authorizations may not be necessary to access certain areas within facilities that are designated as publicly accessible.",
    "group": "Physical and Environmental Protection",
    "parent_id": "pe",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "pe-3",
    "label": "PE-03",
    "title": "Physical Access Control",
    "text": "Physical Access Control\nEnforce physical access authorizations at {{ insert: param, pe-03_odp.01 }} by:\nMaintain physical access audit logs for {{ insert: param, pe-03_odp.04 }};\nControl access to areas within the facility designated as publicly accessible by implementing the following controls: {{ insert: param, pe-03_odp.05 }};\nEscort visitors and control visitor activity {{ insert: param, pe-03_odp.06 }};\nSecure keys, combinations, and other physical access devices;\nInventory {{ insert: param, pe-03_odp.07 }} every {{ insert: param, pe-03_odp.08 }} ; and\nChange combinations and keys {{ insert: param, pe-3_prm_9 }} and/or when keys are lost, combinations are compromised, or when individuals possessing the keys or combinations are transferred or terminated.\nPhysical access control applies to employees and visitors. Individuals with permanent physical access authorizations are not considered visitors. Physical access controls for publicly accessible areas may include physical access control logs/records, guards, or physical access devices and barriers to prevent movement from publicly accessible areas to non-public areas. Organizations determine the types of guards needed, including professional security staff, system users, or administrative staff. Physical access devices include keys, locks, combinations, biometric readers, and card readers. Physical access control systems comply with applicable laws, executive orders, directives, policies, regulations, standards, and guidelines. Organizations have flexibility in the types of audit logs employed. Audit logs can be procedural, automated, or some combination thereof. Physical access points can include facility access points, interior access points to systems that require supplemental access controls, or both. Components of systems may be in areas designated as publicly accessible with organizations controlling access to the components.",
    "group": "Physical and Environmental Protection",
    "parent_id": "pe",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "pe-6",
    "label": "PE-06",
    "title": "Monitoring Physical Access",
    "text": "Monitoring Physical Access\nMonitor physical access to the facility where the system resides to detect and respond to physical security incidents;\nReview physical access logs {{ insert: param, pe-06_odp.01 }} and upon occurrence of {{ insert: param, pe-06_odp.02 }} ; and\nCoordinate results of reviews and investigations with the organizational incident response capability.\nPhysical access monitoring includes publicly accessible areas within organizational facilities. Examples of physical access monitoring include the employment of guards, video surveillance equipment (i.e., cameras), and sensor devices. Reviewing physical access logs can help identify suspicious activity, anomalous events, or potential threats. The reviews can be supported by audit logging controls, such as [AU-2](#au-2) , if the access logs are part of an automated system. Organizational incident response capabilities include investigations of physical security incidents and responses to the incidents. Incidents include security violations or suspicious physical access activities. Suspicious physical access activities include accesses outside of normal work hours, repeated accesses to areas not normally accessed, accesses for unusual lengths of time, and out-of-sequence accesses.",
    "group": "Physical and Environmental Protection",
    "parent_id": "pe",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "pe-8",
    "label": "PE-08",
    "title": "Visitor Access Records",
    "text": "Visitor Access Records\nMaintain visitor access records to the facility where the system resides for {{ insert: param, pe-08_odp.01 }};\nReview visitor access records {{ insert: param, pe-08_odp.02 }} ; and\nReport anomalies in visitor access records to {{ insert: param, pe-08_odp.03 }}.\nVisitor access records include the names and organizations of individuals visiting, visitor signatures, forms of identification, dates of access, entry and departure times, purpose of visits, and the names and organizations of individuals visited. Access record reviews determine if access authorizations are current and are still required to support organizational mission and business functions. Access records are not required for publicly accessible areas.",
    "group": "Physical and Environmental Protection",
    "parent_id": "pe",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "pe-12",
    "label": "PE-12",
    "title": "Emergency Lighting",
    "text": "Emergency Lighting\nEmploy and maintain automatic emergency lighting for the system that activates in the event of a power outage or disruption and that covers emergency exits and evacuation routes within the facility.\nThe provision of emergency lighting applies primarily to organizational facilities that contain concentrations of system resources, including data centers, server rooms, and mainframe computer rooms. Emergency lighting provisions for the system are described in the contingency plan for the organization. If emergency lighting for the system fails or cannot be provided, organizations consider alternate processing sites for power-related contingencies.",
    "group": "Physical and Environmental Protection",
    "parent_id": "pe",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "pe-13",
    "label": "PE-13",
    "title": "Fire Protection",
    "text": "Fire Protection\nEmploy and maintain fire detection and suppression systems that are supported by an independent energy source.\nThe provision of fire detection and suppression systems applies primarily to organizational facilities that contain concentrations of system resources, including data centers, server rooms, and mainframe computer rooms. Fire detection and suppression systems that may require an independent energy source include sprinkler systems and smoke detectors. An independent energy source is an energy source, such as a microgrid, that is separate, or can be separated, from the energy sources providing power for the other parts of the facility.",
    "group": "Physical and Environmental Protection",
    "parent_id": "pe",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "pe-14",
    "label": "PE-14",
    "title": "Environmental Controls",
    "text": "Environmental Controls\nMaintain {{ insert: param, pe-14_odp.01 }} levels within the facility where the system resides at {{ insert: param, pe-14_odp.03 }} ; and\nMonitor environmental control levels {{ insert: param, pe-14_odp.04 }}.\nThe provision of environmental controls applies primarily to organizational facilities that contain concentrations of system resources (e.g., data centers, mainframe computer rooms, and server rooms). Insufficient environmental controls, especially in very harsh environments, can have a significant adverse impact on the availability of systems and system components that are needed to support organizational mission and business functions.",
    "group": "Physical and Environmental Protection",
    "parent_id": "pe",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "pe-15",
    "label": "PE-15",
    "title": "Water Damage Protection",
    "text": "Water Damage Protection\nProtect the system from damage resulting from water leakage by providing master shutoff or isolation valves that are accessible, working properly, and known to key personnel.\nThe provision of water damage protection primarily applies to organizational facilities that contain concentrations of system resources, including data centers, server rooms, and mainframe computer rooms. Isolation valves can be employed in addition to or in lieu of master shutoff valves to shut off water supplies in specific areas of concern without affecting entire organizations.",
    "group": "Physical and Environmental Protection",
    "parent_id": "pe",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "pe-16",
    "label": "PE-16",
    "title": "Delivery and Removal",
    "text": "Delivery and Removal\nAuthorize and control {{ insert: param, pe-16_prm_1 }} entering and exiting the facility; and\nMaintain records of the system components.\nEnforcing authorizations for entry and exit of system components may require restricting access to delivery areas and isolating the areas from the system and media libraries.",
    "group": "Physical and Environmental Protection",
    "parent_id": "pe",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "pl-1",
    "label": "PL-01",
    "title": "Policy and Procedures",
    "text": "Policy and Procedures\nDevelop, document, and disseminate to {{ insert: param, pl-1_prm_1 }}:\nDesignate an {{ insert: param, pl-01_odp.04 }} to manage the development, documentation, and dissemination of the planning policy and procedures; and\nReview and update the current planning:\nPlanning policy and procedures for the controls in the PL family implemented within systems and organizations. The risk management strategy is an important factor in establishing such policies and procedures. Policies and procedures contribute to security and privacy assurance. Therefore, it is important that security and privacy programs collaborate on their development. Security and privacy program policies and procedures at the organization level are preferable, in general, and may obviate the need for mission level or system-specific policies and procedures. The policy can be included as part of the general security and privacy policy or be represented by multiple policies that reflect the complex nature of organizations. Procedures can be established for security and privacy programs, for mission/business processes, and for systems, if needed. Procedures describe how the policies or controls are implemented and can be directed at the individual or role that is the object of the procedure. Procedures can be documented in system security and privacy plans or in one or more separate documents. Events that may precipitate an update to planning policy and procedures include, but are not limited to, assessment or audit findings, security incidents or breaches, or changes in laws, executive orders, directives, regulations, policies, standards, and guidelines. Simply restating controls does not constitute an organizational policy or procedure.",
    "group": "Planning",
    "parent_id": "pl",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "pl-2",
    "label": "PL-02",
    "title": "System Security and Privacy Plans",
    "text": "System Security and Privacy Plans\nDevelop security and privacy plans for the system that:\nDistribute copies of the plans and communicate subsequent changes to the plans to {{ insert: param, pl-02_odp.02 }};\nReview the plans {{ insert: param, pl-02_odp.03 }};\nUpdate the plans to address changes to the system and environment of operation or problems identified during plan implementation or control assessments; and\nProtect the plans from unauthorized disclosure and modification.\nSystem security and privacy plans are scoped to the system and system components within the defined authorization boundary and contain an overview of the security and privacy requirements for the system and the controls selected to satisfy the requirements. The plans describe the intended application of each selected control in the context of the system with a sufficient level of detail to correctly implement the control and to subsequently assess the effectiveness of the control. The control documentation describes how system-specific and hybrid controls are implemented and the plans and expectations regarding the functionality of the system. System security and privacy plans can also be used in the design and development of systems in support of life cycle-based security and privacy engineering processes. System security and privacy plans are living documents that are updated and adapted throughout the system development life cycle (e.g., during capability determination, analysis of alternatives, requests for proposal, and design reviews). [Section 2.1](#c3397cc9-83c6-4459-adb2-836739dc1b94) describes the different types of requirements that are relevant to organizations during the system development life cycle and the relationship between requirements and controls.\n\nOrganizations may develop a single, integrated security and privacy plan or maintain separate plans. Security and privacy plans relate security and privacy requirements to a set of controls and control enhancements. The plans describe how the controls and control enhancements meet the security and privacy requirements but do not provide detailed, technical descriptions of the design or implementation of the controls and control enhancements. Security and privacy plans contain sufficient information (including specifications of control parameter values for selection and assignment operations explicitly or by reference) to enable a design and implementation that is unambiguously compliant with the intent of the plans and subsequent determinations of risk to organizational operations and assets, individuals, other organizations, and the Nation if the plan is implemented.\n\nSecurity and privacy plans need not be single documents. The plans can be a collection of various documents, including documents that already exist. Effective security and privacy plans make extensive use of references to policies, procedures, and additional documents, including design and implementation specifications where more detailed information can be obtained. The use of references helps reduce the documentation associated with security and privacy programs and maintains the security- and privacy-related information in other established management and operational areas, including enterprise architecture, system development life cycle, systems engineering, and acquisition. Security and privacy plans need not contain detailed contingency plan or incident response plan information but can instead provide—explicitly or by reference—sufficient information to define what needs to be accomplished by those plans.\n\nSecurity- and privacy-related activities that may require coordination and planning with other individuals or groups within the organization include assessments, audits, inspections, hardware and software maintenance, acquisition and supply chain risk management, patch management, and contingency plan testing. Planning and coordination include emergency and nonemergency (i.e., planned or non-urgent unplanned) situations. The process defined by organizations to plan and coordinate security- and privacy-related activities can also be included in other documents, as appropriate.",
    "group": "Planning",
    "parent_id": "pl",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "pl-4",
    "label": "PL-04",
    "title": "Rules of Behavior",
    "text": "Rules of Behavior\nEstablish and provide to individuals requiring access to the system, the rules that describe their responsibilities and expected behavior for information and system usage, security, and privacy;\nReceive a documented acknowledgment from such individuals, indicating that they have read, understand, and agree to abide by the rules of behavior, before authorizing access to information and the system;\nReview and update the rules of behavior {{ insert: param, pl-04_odp.01 }} ; and\nRequire individuals who have acknowledged a previous version of the rules of behavior to read and re-acknowledge {{ insert: param, pl-04_odp.02 }}.\nRules of behavior represent a type of access agreement for organizational users. Other types of access agreements include nondisclosure agreements, conflict-of-interest agreements, and acceptable use agreements (see [PS-6](#ps-6) ). Organizations consider rules of behavior based on individual user roles and responsibilities and differentiate between rules that apply to privileged users and rules that apply to general users. Establishing rules of behavior for some types of non-organizational users, including individuals who receive information from federal systems, is often not feasible given the large number of such users and the limited nature of their interactions with the systems. Rules of behavior for organizational and non-organizational users can also be established in [AC-8](#ac-8) . The related controls section provides a list of controls that are relevant to organizational rules of behavior. [PL-4b](#pl-4_smt.b) , the documented acknowledgment portion of the control, may be satisfied by the literacy training and awareness and role-based training programs conducted by organizations if such training includes rules of behavior. Documented acknowledgements for rules of behavior include electronic or physical signatures and electronic agreement check boxes or radio buttons.",
    "group": "Planning",
    "parent_id": "pl",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "pl-4.1",
    "label": "PL-04(01)",
    "title": "Social Media and External Site/Application Usage Restrictions",
    "text": "Social Media and External Site/Application Usage Restrictions\nInclude in the rules of behavior, restrictions on:\nUse of social media, social networking sites, and external sites/applications;\nPosting organizational information on public websites; and\nUse of organization-provided identifiers (e.g., email addresses) and authentication secrets (e.g., passwords) for creating accounts on external sites/applications.\nSocial media, social networking, and external site/application usage restrictions address rules of behavior related to the use of social media, social networking, and external sites when organizational personnel are using such sites for official duties or in the conduct of official business, when organizational information is involved in social media and social networking transactions, and when personnel access social media and networking sites from organizational systems. Organizations also address specific rules that prevent unauthorized entities from obtaining non-public organizational information from social media and networking sites either directly or through inference. Non-public information includes personally identifiable information and system account information.",
    "group": "Planning",
    "parent_id": "pl-4",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "pl-8",
    "label": "PL-08",
    "title": "Security and Privacy Architectures",
    "text": "Security and Privacy Architectures\nDevelop security and privacy architectures for the system that:\nReview and update the architectures {{ insert: param, pl-08_odp }} to reflect changes in the enterprise architecture; and\nReflect planned architecture changes in security and privacy plans, Concept of Operations (CONOPS), criticality analysis, organizational procedures, and procurements and acquisitions.\nThe security and privacy architectures at the system level are consistent with the organization-wide security and privacy architectures described in [PM-7](#pm-7) , which are integral to and developed as part of the enterprise architecture. The architectures include an architectural description, the allocation of security and privacy functionality (including controls), security- and privacy-related information for external interfaces, information being exchanged across the interfaces, and the protection mechanisms associated with each interface. The architectures can also include other information, such as user roles and the access privileges assigned to each role; security and privacy requirements; types of information processed, stored, and transmitted by the system; supply chain risk management requirements; restoration priorities of information and system services; and other protection needs.\n\n[SP 800-160-1](#e3cc0520-a366-4fc9-abc2-5272db7e3564) provides guidance on the use of security architectures as part of the system development life cycle process. [OMB M-19-03](#c5e11048-1d38-4af3-b00b-0d88dc26860c) requires the use of the systems security engineering concepts described in [SP 800-160-1](#e3cc0520-a366-4fc9-abc2-5272db7e3564) for high value assets. Security and privacy architectures are reviewed and updated throughout the system development life cycle, from analysis of alternatives through review of the proposed architecture in the RFP responses to the design reviews before and during implementation (e.g., during preliminary design reviews and critical design reviews).\n\nIn today’s modern computing architectures, it is becoming less common for organizations to control all information resources. There may be key dependencies on external information services and service providers. Describing such dependencies in the security and privacy architectures is necessary for developing a comprehensive mission and business protection strategy. Establishing, developing, documenting, and maintaining under configuration control a baseline configuration for organizational systems is critical to implementing and maintaining effective architectures. The development of the architectures is coordinated with the senior agency information security officer and the senior agency official for privacy to ensure that the controls needed to support security and privacy requirements are identified and effectively implemented. In many circumstances, there may be no distinction between the security and privacy architecture for a system. In other circumstances, security objectives may be adequately satisfied, but privacy objectives may only be partially satisfied by the security requirements. In these cases, consideration of the privacy requirements needed to achieve satisfaction will result in a distinct privacy architecture. The documentation, however, may simply reflect the combined architectures.\n\n[PL-8](#pl-8) is primarily directed at organizations to ensure that architectures are developed for the system and, moreover, that the architectures are integrated with or tightly coupled to the enterprise architecture. In contrast, [SA-17](#sa-17) is primarily directed at the external information technology product and system developers and integrators. [SA-17](#sa-17) , which is complementary to [PL-8](#pl-8) , is selected when organizations outsource the development of systems or components to external entities and when there is a need to demonstrate consistency with the organization’s enterprise architecture and security and privacy architectures.",
    "group": "Planning",
    "parent_id": "pl",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "pl-10",
    "label": "PL-10",
    "title": "Baseline Selection",
    "text": "Baseline Selection\nSelect a control baseline for the system.\nControl baselines are predefined sets of controls specifically assembled to address the protection needs of a group, organization, or community of interest. Controls are chosen for baselines to either satisfy mandates imposed by laws, executive orders, directives, regulations, policies, standards, and guidelines or address threats common to all users of the baseline under the assumptions specific to the baseline. Baselines represent a starting point for the protection of individuals’ privacy, information, and information systems with subsequent tailoring actions to manage risk in accordance with mission, business, or other constraints (see [PL-11](#pl-11) ). Federal control baselines are provided in [SP 800-53B](#46d9e201-840e-440e-987c-2c773333c752) . The selection of a control baseline is determined by the needs of stakeholders. Stakeholder needs consider mission and business requirements as well as mandates imposed by applicable laws, executive orders, directives, policies, regulations, standards, and guidelines. For example, the control baselines in [SP 800-53B](#46d9e201-840e-440e-987c-2c773333c752) are based on the requirements from [FISMA](#0c67b2a9-bede-43d2-b86d-5f35b8be36e9) and [PRIVACT](#18e71fec-c6fd-475a-925a-5d8495cf8455) . The requirements, along with the NIST standards and guidelines implementing the legislation, direct organizations to select one of the control baselines after the reviewing the information types and the information that is processed, stored, and transmitted on the system; analyzing the potential adverse impact of the loss or compromise of the information or system on the organization’s operations and assets, individuals, other organizations, or the Nation; and considering the results from system and organizational risk assessments. [CNSSI 1253](#4e4fbc93-333d-45e6-a875-de36b878b6b9) provides guidance on control baselines for national security systems.",
    "group": "Planning",
    "parent_id": "pl",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "pl-11",
    "label": "PL-11",
    "title": "Baseline Tailoring",
    "text": "Baseline Tailoring\nTailor the selected control baseline by applying specified tailoring actions.\nThe concept of tailoring allows organizations to specialize or customize a set of baseline controls by applying a defined set of tailoring actions. Tailoring actions facilitate such specialization and customization by allowing organizations to develop security and privacy plans that reflect their specific mission and business functions, the environments where their systems operate, the threats and vulnerabilities that can affect their systems, and any other conditions or situations that can impact their mission or business success. Tailoring guidance is provided in [SP 800-53B](#46d9e201-840e-440e-987c-2c773333c752) . Tailoring a control baseline is accomplished by identifying and designating common controls, applying scoping considerations, selecting compensating controls, assigning values to control parameters, supplementing the control baseline with additional controls as needed, and providing information for control implementation. The general tailoring actions in [SP 800-53B](#46d9e201-840e-440e-987c-2c773333c752) can be supplemented with additional actions based on the needs of organizations. Tailoring actions can be applied to the baselines in [SP 800-53B](#46d9e201-840e-440e-987c-2c773333c752) in accordance with the security and privacy requirements from [FISMA](#0c67b2a9-bede-43d2-b86d-5f35b8be36e9), [PRIVACT](#18e71fec-c6fd-475a-925a-5d8495cf8455) , and [OMB A-130](#27847491-5ce1-4f6a-a1e4-9e483782f0ef) . Alternatively, other communities of interest adopting different control baselines can apply the tailoring actions in [SP 800-53B](#46d9e201-840e-440e-987c-2c773333c752) to specialize or customize the controls that represent the specific needs and concerns of those entities.",
    "group": "Planning",
    "parent_id": "pl",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ps-1",
    "label": "PS-01",
    "title": "Policy and Procedures",
    "text": "Policy and Procedures\nDevelop, document, and disseminate to {{ insert: param, ps-1_prm_1 }}:\nDesignate an {{ insert: param, ps-01_odp.04 }} to manage the development, documentation, and dissemination of the personnel security policy and procedures; and\nReview and update the current personnel security:\nPersonnel security policy and procedures for the controls in the PS family that are implemented within systems and organizations. The risk management strategy is an important factor in establishing such policies and procedures. Policies and procedures contribute to security and privacy assurance. Therefore, it is important that security and privacy programs collaborate on their development. Security and privacy program policies and procedures at the organization level are preferable, in general, and may obviate the need for mission level or system-specific policies and procedures. The policy can be included as part of the general security and privacy policy or be represented by multiple policies reflecting the complex nature of organizations. Procedures can be established for security and privacy programs, for mission/business processes, and for systems, if needed. Procedures describe how the policies or controls are implemented and can be directed at the individual or role that is the object of the procedure. Procedures can be documented in system security and privacy plans or in one or more separate documents. Events that may precipitate an update to personnel security policy and procedures include, but are not limited to, assessment or audit findings, security incidents or breaches, or changes in applicable laws, executive orders, directives, regulations, policies, standards, and guidelines. Simply restating controls does not constitute an organizational policy or procedure.",
    "group": "Personnel Security",
    "parent_id": "ps",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ps-2",
    "label": "PS-02",
    "title": "Position Risk Designation",
    "text": "Position Risk Designation\nAssign a risk designation to all organizational positions;\nEstablish screening criteria for individuals filling those positions; and\nReview and update position risk designations {{ insert: param, ps-02_odp }}.\nPosition risk designations reflect Office of Personnel Management (OPM) policy and guidance. Proper position designation is the foundation of an effective and consistent suitability and personnel security program. The Position Designation System (PDS) assesses the duties and responsibilities of a position to determine the degree of potential damage to the efficiency or integrity of the service due to misconduct of an incumbent of a position and establishes the risk level of that position. The PDS assessment also determines if the duties and responsibilities of the position present the potential for position incumbents to bring about a material adverse effect on national security and the degree of that potential effect, which establishes the sensitivity level of a position. The results of the assessment determine what level of investigation is conducted for a position. Risk designations can guide and inform the types of authorizations that individuals receive when accessing organizational information and information systems. Position screening criteria include explicit information security role appointment requirements. Parts 1400 and 731 of Title 5, Code of Federal Regulations, establish the requirements for organizations to evaluate relevant covered positions for a position sensitivity and position risk designation commensurate with the duties and responsibilities of those positions.",
    "group": "Personnel Security",
    "parent_id": "ps",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ps-3",
    "label": "PS-03",
    "title": "Personnel Screening",
    "text": "Personnel Screening\nScreen individuals prior to authorizing access to the system; and\nRescreen individuals in accordance with {{ insert: param, ps-3_prm_1 }}.\nPersonnel screening and rescreening activities reflect applicable laws, executive orders, directives, regulations, policies, standards, guidelines, and specific criteria established for the risk designations of assigned positions. Examples of personnel screening include background investigations and agency checks. Organizations may define different rescreening conditions and frequencies for personnel accessing systems based on types of information processed, stored, or transmitted by the systems.",
    "group": "Personnel Security",
    "parent_id": "ps",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ps-4",
    "label": "PS-04",
    "title": "Personnel Termination",
    "text": "Personnel Termination\nUpon termination of individual employment:\nDisable system access within {{ insert: param, ps-04_odp.01 }};\nTerminate or revoke any authenticators and credentials associated with the individual;\nConduct exit interviews that include a discussion of {{ insert: param, ps-04_odp.02 }};\nRetrieve all security-related organizational system-related property; and\nRetain access to organizational information and systems formerly controlled by terminated individual.\nSystem property includes hardware authentication tokens, system administration technical manuals, keys, identification cards, and building passes. Exit interviews ensure that terminated individuals understand the security constraints imposed by being former employees and that proper accountability is achieved for system-related property. Security topics at exit interviews include reminding individuals of nondisclosure agreements and potential limitations on future employment. Exit interviews may not always be possible for some individuals, including in cases related to the unavailability of supervisors, illnesses, or job abandonment. Exit interviews are important for individuals with security clearances. The timely execution of termination actions is essential for individuals who have been terminated for cause. In certain situations, organizations consider disabling the system accounts of individuals who are being terminated prior to the individuals being notified.",
    "group": "Personnel Security",
    "parent_id": "ps",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ps-5",
    "label": "PS-05",
    "title": "Personnel Transfer",
    "text": "Personnel Transfer\nReview and confirm ongoing operational need for current logical and physical access authorizations to systems and facilities when individuals are reassigned or transferred to other positions within the organization;\nInitiate {{ insert: param, ps-05_odp.01 }} within {{ insert: param, ps-05_odp.02 }};\nModify access authorization as needed to correspond with any changes in operational need due to reassignment or transfer; and\nNotify {{ insert: param, ps-05_odp.03 }} within {{ insert: param, ps-05_odp.04 }}.\nPersonnel transfer applies when reassignments or transfers of individuals are permanent or of such extended duration as to make the actions warranted. Organizations define actions appropriate for the types of reassignments or transfers, whether permanent or extended. Actions that may be required for personnel transfers or reassignments to other positions within organizations include returning old and issuing new keys, identification cards, and building passes; closing system accounts and establishing new accounts; changing system access authorizations (i.e., privileges); and providing for access to official records to which individuals had access at previous work locations and in previous system accounts.",
    "group": "Personnel Security",
    "parent_id": "ps",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ps-6",
    "label": "PS-06",
    "title": "Access Agreements",
    "text": "Access Agreements\nDevelop and document access agreements for organizational systems;\nReview and update the access agreements {{ insert: param, ps-06_odp.01 }} ; and\nVerify that individuals requiring access to organizational information and systems:\nAccess agreements include nondisclosure agreements, acceptable use agreements, rules of behavior, and conflict-of-interest agreements. Signed access agreements include an acknowledgement that individuals have read, understand, and agree to abide by the constraints associated with organizational systems to which access is authorized. Organizations can use electronic signatures to acknowledge access agreements unless specifically prohibited by organizational policy.",
    "group": "Personnel Security",
    "parent_id": "ps",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ps-7",
    "label": "PS-07",
    "title": "External Personnel Security",
    "text": "External Personnel Security\nEstablish personnel security requirements, including security roles and responsibilities for external providers;\nRequire external providers to comply with personnel security policies and procedures established by the organization;\nDocument personnel security requirements;\nRequire external providers to notify {{ insert: param, ps-07_odp.01 }} of any personnel transfers or terminations of external personnel who possess organizational credentials and/or badges, or who have system privileges within {{ insert: param, ps-07_odp.02 }} ; and\nMonitor provider compliance with personnel security requirements.\nExternal provider refers to organizations other than the organization operating or acquiring the system. External providers include service bureaus, contractors, and other organizations that provide system development, information technology services, testing or assessment services, outsourced applications, and network/security management. Organizations explicitly include personnel security requirements in acquisition-related documents. External providers may have personnel working at organizational facilities with credentials, badges, or system privileges issued by organizations. Notifications of external personnel changes ensure the appropriate termination of privileges and credentials. Organizations define the transfers and terminations deemed reportable by security-related characteristics that include functions, roles, and the nature of credentials or privileges associated with transferred or terminated individuals.",
    "group": "Personnel Security",
    "parent_id": "ps",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ps-8",
    "label": "PS-08",
    "title": "Personnel Sanctions",
    "text": "Personnel Sanctions\nEmploy a formal sanctions process for individuals failing to comply with established information security and privacy policies and procedures; and\nNotify {{ insert: param, ps-08_odp.01 }} within {{ insert: param, ps-08_odp.02 }} when a formal employee sanctions process is initiated, identifying the individual sanctioned and the reason for the sanction.\nOrganizational sanctions reflect applicable laws, executive orders, directives, regulations, policies, standards, and guidelines. Sanctions processes are described in access agreements and can be included as part of general personnel policies for organizations and/or specified in security and privacy policies. Organizations consult with the Office of the General Counsel regarding matters of employee sanctions.",
    "group": "Personnel Security",
    "parent_id": "ps",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ps-9",
    "label": "PS-09",
    "title": "Position Descriptions",
    "text": "Position Descriptions\nIncorporate security and privacy roles and responsibilities into organizational position descriptions.\nSpecification of security and privacy roles in individual organizational position descriptions facilitates clarity in understanding the security or privacy responsibilities associated with the roles and the role-based security and privacy training requirements for the roles.",
    "group": "Personnel Security",
    "parent_id": "ps",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ra-1",
    "label": "RA-01",
    "title": "Policy and Procedures",
    "text": "Policy and Procedures\nDevelop, document, and disseminate to {{ insert: param, ra-1_prm_1 }}:\nDesignate an {{ insert: param, ra-01_odp.04 }} to manage the development, documentation, and dissemination of the risk assessment policy and procedures; and\nReview and update the current risk assessment:\nRisk assessment policy and procedures address the controls in the RA family that are implemented within systems and organizations. The risk management strategy is an important factor in establishing such policies and procedures. Policies and procedures contribute to security and privacy assurance. Therefore, it is important that security and privacy programs collaborate on the development of risk assessment policy and procedures. Security and privacy program policies and procedures at the organization level are preferable, in general, and may obviate the need for mission- or system-specific policies and procedures. The policy can be included as part of the general security and privacy policy or be represented by multiple policies reflecting the complex nature of organizations. Procedures can be established for security and privacy programs, for mission or business processes, and for systems, if needed. Procedures describe how the policies or controls are implemented and can be directed at the individual or role that is the object of the procedure. Procedures can be documented in system security and privacy plans or in one or more separate documents. Events that may precipitate an update to risk assessment policy and procedures include assessment or audit findings, security incidents or breaches, or changes in laws, executive orders, directives, regulations, policies, standards, and guidelines. Simply restating controls does not constitute an organizational policy or procedure.",
    "group": "Risk Assessment",
    "parent_id": "ra",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ra-2",
    "label": "RA-02",
    "title": "Security Categorization",
    "text": "Security Categorization\nCategorize the system and information it processes, stores, and transmits;\nDocument the security categorization results, including supporting rationale, in the security plan for the system; and\nVerify that the authorizing official or authorizing official designated representative reviews and approves the security categorization decision.\nSecurity categories describe the potential adverse impacts or negative consequences to organizational operations, organizational assets, and individuals if organizational information and systems are compromised through a loss of confidentiality, integrity, or availability. Security categorization is also a type of asset loss characterization in systems security engineering processes that is carried out throughout the system development life cycle. Organizations can use privacy risk assessments or privacy impact assessments to better understand the potential adverse effects on individuals. [CNSSI 1253](#4e4fbc93-333d-45e6-a875-de36b878b6b9) provides additional guidance on categorization for national security systems.\n\nOrganizations conduct the security categorization process as an organization-wide activity with the direct involvement of chief information officers, senior agency information security officers, senior agency officials for privacy, system owners, mission and business owners, and information owners or stewards. Organizations consider the potential adverse impacts to other organizations and, in accordance with [USA PATRIOT](#13f0c39d-eaf7-417a-baef-69a041878bb5) and Homeland Security Presidential Directives, potential national-level adverse impacts.\n\nSecurity categorization processes facilitate the development of inventories of information assets and, along with [CM-8](#cm-8) , mappings to specific system components where information is processed, stored, or transmitted. The security categorization process is revisited throughout the system development life cycle to ensure that the security categories remain accurate and relevant.",
    "group": "Risk Assessment",
    "parent_id": "ra",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ra-3",
    "label": "RA-03",
    "title": "Risk Assessment",
    "text": "Risk Assessment\nConduct a risk assessment, including:\nIntegrate risk assessment results and risk management decisions from the organization and mission or business process perspectives with system-level risk assessments;\nDocument risk assessment results in {{ insert: param, ra-03_odp.01 }};\nReview risk assessment results {{ insert: param, ra-03_odp.03 }};\nDisseminate risk assessment results to {{ insert: param, ra-03_odp.04 }} ; and\nUpdate the risk assessment {{ insert: param, ra-03_odp.05 }} or when there are significant changes to the system, its environment of operation, or other conditions that may impact the security or privacy state of the system.\nRisk assessments consider threats, vulnerabilities, likelihood, and impact to organizational operations and assets, individuals, other organizations, and the Nation. Risk assessments also consider risk from external parties, including contractors who operate systems on behalf of the organization, individuals who access organizational systems, service providers, and outsourcing entities.\n\nOrganizations can conduct risk assessments at all three levels in the risk management hierarchy (i.e., organization level, mission/business process level, or information system level) and at any stage in the system development life cycle. Risk assessments can also be conducted at various steps in the Risk Management Framework, including preparation, categorization, control selection, control implementation, control assessment, authorization, and control monitoring. Risk assessment is an ongoing activity carried out throughout the system development life cycle.\n\nRisk assessments can also address information related to the system, including system design, the intended use of the system, testing results, and supply chain-related information or artifacts. Risk assessments can play an important role in control selection processes, particularly during the application of tailoring guidance and in the earliest phases of capability determination.",
    "group": "Risk Assessment",
    "parent_id": "ra",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ra-3.1",
    "label": "RA-03(01)",
    "title": "Supply Chain Risk Assessment",
    "text": "Supply Chain Risk Assessment\nAssess supply chain risks associated with {{ insert: param, ra-03.01_odp.01 }} ; and\nUpdate the supply chain risk assessment {{ insert: param, ra-03.01_odp.02 }} , when there are significant changes to the relevant supply chain, or when changes to the system, environments of operation, or other conditions may necessitate a change in the supply chain.\nSupply chain-related events include disruption, use of defective components, insertion of counterfeits, theft, malicious development practices, improper delivery practices, and insertion of malicious code. These events can have a significant impact on the confidentiality, integrity, or availability of a system and its information and, therefore, can also adversely impact organizational operations (including mission, functions, image, or reputation), organizational assets, individuals, other organizations, and the Nation. The supply chain-related events may be unintentional or malicious and can occur at any point during the system life cycle. An analysis of supply chain risk can help an organization identify systems or components for which additional supply chain risk mitigations are required.",
    "group": "Risk Assessment",
    "parent_id": "ra-3",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ra-5",
    "label": "RA-05",
    "title": "Vulnerability Monitoring and Scanning",
    "text": "Vulnerability Monitoring and Scanning\nMonitor and scan for vulnerabilities in the system and hosted applications {{ insert: param, ra-5_prm_1 }} and when new vulnerabilities potentially affecting the system are identified and reported;\nEmploy vulnerability monitoring tools and techniques that facilitate interoperability among tools and automate parts of the vulnerability management process by using standards for:\nAnalyze vulnerability scan reports and results from vulnerability monitoring;\nRemediate legitimate vulnerabilities {{ insert: param, ra-05_odp.03 }} in accordance with an organizational assessment of risk;\nShare information obtained from the vulnerability monitoring process and control assessments with {{ insert: param, ra-05_odp.04 }} to help eliminate similar vulnerabilities in other systems; and\nEmploy vulnerability monitoring tools that include the capability to readily update the vulnerabilities to be scanned.\nSecurity categorization of information and systems guides the frequency and comprehensiveness of vulnerability monitoring (including scans). Organizations determine the required vulnerability monitoring for system components, ensuring that the potential sources of vulnerabilities—such as infrastructure components (e.g., switches, routers, guards, sensors), networked printers, scanners, and copiers—are not overlooked. The capability to readily update vulnerability monitoring tools as new vulnerabilities are discovered and announced and as new scanning methods are developed helps to ensure that new vulnerabilities are not missed by employed vulnerability monitoring tools. The vulnerability monitoring tool update process helps to ensure that potential vulnerabilities in the system are identified and addressed as quickly as possible. Vulnerability monitoring and analyses for custom software may require additional approaches, such as static analysis, dynamic analysis, binary analysis, or a hybrid of the three approaches. Organizations can use these analysis approaches in source code reviews and in a variety of tools, including web-based application scanners, static analysis tools, and binary analyzers.\n\nVulnerability monitoring includes scanning for patch levels; scanning for functions, ports, protocols, and services that should not be accessible to users or devices; and scanning for flow control mechanisms that are improperly configured or operating incorrectly. Vulnerability monitoring may also include continuous vulnerability monitoring tools that use instrumentation to continuously analyze components. Instrumentation-based tools may improve accuracy and may be run throughout an organization without scanning. Vulnerability monitoring tools that facilitate interoperability include tools that are Security Content Automated Protocol (SCAP)-validated. Thus, organizations consider using scanning tools that express vulnerabilities in the Common Vulnerabilities and Exposures (CVE) naming convention and that employ the Open Vulnerability Assessment Language (OVAL) to determine the presence of vulnerabilities. Sources for vulnerability information include the Common Weakness Enumeration (CWE) listing and the National Vulnerability Database (NVD). Control assessments, such as red team exercises, provide additional sources of potential vulnerabilities for which to scan. Organizations also consider using scanning tools that express vulnerability impact by the Common Vulnerability Scoring System (CVSS).\n\nVulnerability monitoring includes a channel and process for receiving reports of security vulnerabilities from the public at-large. Vulnerability disclosure programs can be as simple as publishing a monitored email address or web form that can receive reports, including notification authorizing good-faith research and disclosure of security vulnerabilities. Organizations generally expect that such research is happening with or without their authorization and can use public vulnerability disclosure channels to increase the likelihood that discovered vulnerabilities are reported directly to the organization for remediation.\n\nOrganizations may also employ the use of financial incentives (also known as \"bug bounties\" ) to further encourage external security researchers to report discovered vulnerabilities. Bug bounty programs can be tailored to the organization’s needs. Bounties can be operated indefinitely or over a defined period of time and can be offered to the general public or to a curated group. Organizations may run public and private bounties simultaneously and could choose to offer partially credentialed access to certain participants in order to evaluate security vulnerabilities from privileged vantage points.",
    "group": "Risk Assessment",
    "parent_id": "ra",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ra-5.2",
    "label": "RA-05(02)",
    "title": "Update Vulnerabilities to Be Scanned",
    "text": "Update Vulnerabilities to Be Scanned\nUpdate the system vulnerabilities to be scanned {{ insert: param, ra-05.02_odp.01 }}.\nDue to the complexity of modern software, systems, and other factors, new vulnerabilities are discovered on a regular basis. It is important that newly discovered vulnerabilities are added to the list of vulnerabilities to be scanned to ensure that the organization can take steps to mitigate those vulnerabilities in a timely manner.",
    "group": "Risk Assessment",
    "parent_id": "ra-5",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ra-5.11",
    "label": "RA-05(11)",
    "title": "Public Disclosure Program",
    "text": "Public Disclosure Program\nEstablish a public reporting channel for receiving reports of vulnerabilities in organizational systems and system components.\nThe reporting channel is publicly discoverable and contains clear language authorizing good-faith research and the disclosure of vulnerabilities to the organization. The organization does not condition its authorization on an expectation of indefinite non-disclosure to the public by the reporting entity but may request a specific time period to properly remediate the vulnerability.",
    "group": "Risk Assessment",
    "parent_id": "ra-5",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "ra-7",
    "label": "RA-07",
    "title": "Risk Response",
    "text": "Risk Response\nRespond to findings from security and privacy assessments, monitoring, and audits in accordance with organizational risk tolerance.\nOrganizations have many options for responding to risk including mitigating risk by implementing new controls or strengthening existing controls, accepting risk with appropriate justification or rationale, sharing or transferring risk, or avoiding risk. The risk tolerance of the organization influences risk response decisions and actions. Risk response addresses the need to determine an appropriate response to risk before generating a plan of action and milestones entry. For example, the response may be to accept risk or reject risk, or it may be possible to mitigate the risk immediately so that a plan of action and milestones entry is not needed. However, if the risk response is to mitigate the risk, and the mitigation cannot be completed immediately, a plan of action and milestones entry is generated.",
    "group": "Risk Assessment",
    "parent_id": "ra",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sa-1",
    "label": "SA-01",
    "title": "Policy and Procedures",
    "text": "Policy and Procedures\nDevelop, document, and disseminate to {{ insert: param, sa-1_prm_1 }}:\nDesignate an {{ insert: param, sa-01_odp.04 }} to manage the development, documentation, and dissemination of the system and services acquisition policy and procedures; and\nReview and update the current system and services acquisition:\nSystem and services acquisition policy and procedures address the controls in the SA family that are implemented within systems and organizations. The risk management strategy is an important factor in establishing such policies and procedures. Policies and procedures contribute to security and privacy assurance. Therefore, it is important that security and privacy programs collaborate on the development of system and services acquisition policy and procedures. Security and privacy program policies and procedures at the organization level are preferable, in general, and may obviate the need for mission- or system-specific policies and procedures. The policy can be included as part of the general security and privacy policy or be represented by multiple policies that reflect the complex nature of organizations. Procedures can be established for security and privacy programs, for mission or business processes, and for systems, if needed. Procedures describe how the policies or controls are implemented and can be directed at the individual or role that is the object of the procedure. Procedures can be documented in system security and privacy plans or in one or more separate documents. Events that may precipitate an update to system and services acquisition policy and procedures include assessment or audit findings, security incidents or breaches, or changes in laws, executive orders, directives, regulations, policies, standards, and guidelines. Simply restating controls does not constitute an organizational policy or procedure.",
    "group": "System and Services Acquisition",
    "parent_id": "sa",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sa-2",
    "label": "SA-02",
    "title": "Allocation of Resources",
    "text": "Allocation of Resources\nDetermine the high-level information security and privacy requirements for the system or system service in mission and business process planning;\nDetermine, document, and allocate the resources required to protect the system or system service as part of the organizational capital planning and investment control process; and\nEstablish a discrete line item for information security and privacy in organizational programming and budgeting documentation.\nResource allocation for information security and privacy includes funding for system and services acquisition, sustainment, and supply chain-related risks throughout the system development life cycle.",
    "group": "System and Services Acquisition",
    "parent_id": "sa",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sa-3",
    "label": "SA-03",
    "title": "System Development Life Cycle",
    "text": "System Development Life Cycle\nAcquire, develop, and manage the system using {{ insert: param, sa-03_odp }} that incorporates information security and privacy considerations;\nDefine and document information security and privacy roles and responsibilities throughout the system development life cycle;\nIdentify individuals having information security and privacy roles and responsibilities; and\nIntegrate the organizational information security and privacy risk management process into system development life cycle activities.\nA system development life cycle process provides the foundation for the successful development, implementation, and operation of organizational systems. The integration of security and privacy considerations early in the system development life cycle is a foundational principle of systems security engineering and privacy engineering. To apply the required controls within the system development life cycle requires a basic understanding of information security and privacy, threats, vulnerabilities, adverse impacts, and risk to critical mission and business functions. The security engineering principles in [SA-8](#sa-8) help individuals properly design, code, and test systems and system components. Organizations include qualified personnel (e.g., senior agency information security officers, senior agency officials for privacy, security and privacy architects, and security and privacy engineers) in system development life cycle processes to ensure that established security and privacy requirements are incorporated into organizational systems. Role-based security and privacy training programs can ensure that individuals with key security and privacy roles and responsibilities have the experience, skills, and expertise to conduct assigned system development life cycle activities.\n\nThe effective integration of security and privacy requirements into enterprise architecture also helps to ensure that important security and privacy considerations are addressed throughout the system life cycle and that those considerations are directly related to organizational mission and business processes. This process also facilitates the integration of the information security and privacy architectures into the enterprise architecture, consistent with the risk management strategy of the organization. Because the system development life cycle involves multiple organizations, (e.g., external suppliers, developers, integrators, service providers), acquisition and supply chain risk management functions and controls play significant roles in the effective management of the system during the life cycle.",
    "group": "System and Services Acquisition",
    "parent_id": "sa",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sa-4",
    "label": "SA-04",
    "title": "Acquisition Process",
    "text": "Acquisition Process\nInclude the following requirements, descriptions, and criteria, explicitly or by reference, using {{ insert: param, sa-04_odp.01 }} in the acquisition contract for the system, system component, or system service:\nSecurity and privacy functional requirements;\nStrength of mechanism requirements;\nSecurity and privacy assurance requirements;\nControls needed to satisfy the security and privacy requirements.\nSecurity and privacy documentation requirements;\nRequirements for protecting security and privacy documentation;\nDescription of the system development environment and environment in which the system is intended to operate;\nAllocation of responsibility or identification of parties responsible for information security, privacy, and supply chain risk management; and\nAcceptance criteria.\nSecurity and privacy functional requirements are typically derived from the high-level security and privacy requirements described in [SA-2](#sa-2) . The derived requirements include security and privacy capabilities, functions, and mechanisms. Strength requirements associated with such capabilities, functions, and mechanisms include degree of correctness, completeness, resistance to tampering or bypass, and resistance to direct attack. Assurance requirements include development processes, procedures, and methodologies as well as the evidence from development and assessment activities that provide grounds for confidence that the required functionality is implemented and possesses the required strength of mechanism. [SP 800-160-1](#e3cc0520-a366-4fc9-abc2-5272db7e3564) describes the process of requirements engineering as part of the system development life cycle.\n\nControls can be viewed as descriptions of the safeguards and protection capabilities appropriate for achieving the particular security and privacy objectives of the organization and for reflecting the security and privacy requirements of stakeholders. Controls are selected and implemented in order to satisfy system requirements and include developer and organizational responsibilities. Controls can include technical, administrative, and physical aspects. In some cases, the selection and implementation of a control may necessitate additional specification by the organization in the form of derived requirements or instantiated control parameter values. The derived requirements and control parameter values may be necessary to provide the appropriate level of implementation detail for controls within the system development life cycle.\n\nSecurity and privacy documentation requirements address all stages of the system development life cycle. Documentation provides user and administrator guidance for the implementation and operation of controls. The level of detail required in such documentation is based on the security categorization or classification level of the system and the degree to which organizations depend on the capabilities, functions, or mechanisms to meet risk response expectations. Requirements can include mandated configuration settings that specify allowed functions, ports, protocols, and services. Acceptance criteria for systems, system components, and system services are defined in the same manner as the criteria for any organizational acquisition or procurement.",
    "group": "System and Services Acquisition",
    "parent_id": "sa",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sa-4.10",
    "label": "SA-04(10)",
    "title": "Use of Approved PIV Products",
    "text": "Use of Approved PIV Products\nEmploy only information technology products on the FIPS 201-approved products list for Personal Identity Verification (PIV) capability implemented within organizational systems.\nProducts on the FIPS 201-approved products list meet NIST requirements for Personal Identity Verification (PIV) of Federal Employees and Contractors. PIV cards are used for multi-factor authentication in systems and organizations.",
    "group": "System and Services Acquisition",
    "parent_id": "sa-4",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sa-5",
    "label": "SA-05",
    "title": "System Documentation",
    "text": "System Documentation\nObtain or develop administrator documentation for the system, system component, or system service that describes:\nObtain or develop user documentation for the system, system component, or system service that describes:\nDocument attempts to obtain system, system component, or system service documentation when such documentation is either unavailable or nonexistent and take {{ insert: param, sa-05_odp.01 }} in response; and\nDistribute documentation to {{ insert: param, sa-05_odp.02 }}.\nSystem documentation helps personnel understand the implementation and operation of controls. Organizations consider establishing specific measures to determine the quality and completeness of the content provided. System documentation may be used to support the management of supply chain risk, incident response, and other functions. Personnel or roles that require documentation include system owners, system security officers, and system administrators. Attempts to obtain documentation include contacting manufacturers or suppliers and conducting web-based searches. The inability to obtain documentation may occur due to the age of the system or component or the lack of support from developers and contractors. When documentation cannot be obtained, organizations may need to recreate the documentation if it is essential to the implementation or operation of the controls. The protection provided for the documentation is commensurate with the security category or classification of the system. Documentation that addresses system vulnerabilities may require an increased level of protection. Secure operation of the system includes initially starting the system and resuming secure system operation after a lapse in system operation.",
    "group": "System and Services Acquisition",
    "parent_id": "sa",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sa-8",
    "label": "SA-08",
    "title": "Security and Privacy Engineering Principles",
    "text": "Security and Privacy Engineering Principles\nApply the following systems security and privacy engineering principles in the specification, design, development, implementation, and modification of the system and system components: {{ insert: param, sa-8_prm_1 }}.\nSystems security and privacy engineering principles are closely related to and implemented throughout the system development life cycle (see [SA-3](#sa-3) ). Organizations can apply systems security and privacy engineering principles to new systems under development or to systems undergoing upgrades. For existing systems, organizations apply systems security and privacy engineering principles to system upgrades and modifications to the extent feasible, given the current state of hardware, software, and firmware components within those systems.\n\nThe application of systems security and privacy engineering principles helps organizations develop trustworthy, secure, and resilient systems and reduces the susceptibility to disruptions, hazards, threats, and the creation of privacy problems for individuals. Examples of system security engineering principles include: developing layered protections; establishing security and privacy policies, architecture, and controls as the foundation for design and development; incorporating security and privacy requirements into the system development life cycle; delineating physical and logical security boundaries; ensuring that developers are trained on how to build secure software; tailoring controls to meet organizational needs; and performing threat modeling to identify use cases, threat agents, attack vectors and patterns, design patterns, and compensating controls needed to mitigate risk.\n\nOrganizations that apply systems security and privacy engineering concepts and principles can facilitate the development of trustworthy, secure systems, system components, and system services; reduce risk to acceptable levels; and make informed risk management decisions. System security engineering principles can also be used to protect against certain supply chain risks, including incorporating tamper-resistant hardware into a design.",
    "group": "System and Services Acquisition",
    "parent_id": "sa",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sa-9",
    "label": "SA-09",
    "title": "External System Services",
    "text": "External System Services\nRequire that providers of external system services comply with organizational security and privacy requirements and employ the following controls: {{ insert: param, sa-09_odp.01 }};\nDefine and document organizational oversight and user roles and responsibilities with regard to external system services; and\nEmploy the following processes, methods, and techniques to monitor control compliance by external service providers on an ongoing basis: {{ insert: param, sa-09_odp.02 }}.\nExternal system services are provided by an external provider, and the organization has no direct control over the implementation of the required controls or the assessment of control effectiveness. Organizations establish relationships with external service providers in a variety of ways, including through business partnerships, contracts, interagency agreements, lines of business arrangements, licensing agreements, joint ventures, and supply chain exchanges. The responsibility for managing risks from the use of external system services remains with authorizing officials. For services external to organizations, a chain of trust requires that organizations establish and retain a certain level of confidence that each provider in the consumer-provider relationship provides adequate protection for the services rendered. The extent and nature of this chain of trust vary based on relationships between organizations and the external providers. Organizations document the basis for the trust relationships so that the relationships can be monitored. External system services documentation includes government, service providers, end user security roles and responsibilities, and service-level agreements. Service-level agreements define the expectations of performance for implemented controls, describe measurable outcomes, and identify remedies and response requirements for identified instances of noncompliance.",
    "group": "System and Services Acquisition",
    "parent_id": "sa",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sa-22",
    "label": "SA-22",
    "title": "Unsupported System Components",
    "text": "Unsupported System Components\nReplace system components when support for the components is no longer available from the developer, vendor, or manufacturer; or\nProvide the following options for alternative sources for continued support for unsupported components {{ insert: param, sa-22_odp.01 }}.\nSupport for system components includes software patches, firmware updates, replacement parts, and maintenance contracts. An example of unsupported components includes when vendors no longer provide critical software patches or product updates, which can result in an opportunity for adversaries to exploit weaknesses in the installed components. Exceptions to replacing unsupported system components include systems that provide critical mission or business capabilities where newer technologies are not available or where the systems are so isolated that installing replacement components is not an option.\n\nAlternative sources for support address the need to provide continued support for system components that are no longer supported by the original manufacturers, developers, or vendors when such components remain essential to organizational mission and business functions. If necessary, organizations can establish in-house support by developing customized patches for critical software components or, alternatively, obtain the services of external providers who provide ongoing support for the designated unsupported components through contractual relationships. Such contractual relationships can include open-source software value-added vendors. The increased risk of using unsupported system components can be mitigated, for example, by prohibiting the connection of such components to public or uncontrolled networks, or implementing other forms of isolation.",
    "group": "System and Services Acquisition",
    "parent_id": "sa",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sc-1",
    "label": "SC-01",
    "title": "Policy and Procedures",
    "text": "Policy and Procedures\nDevelop, document, and disseminate to {{ insert: param, sc-1_prm_1 }}:\nDesignate an {{ insert: param, sc-01_odp.04 }} to manage the development, documentation, and dissemination of the system and communications protection policy and procedures; and\nReview and update the current system and communications protection:\nSystem and communications protection policy and procedures address the controls in the SC family that are implemented within systems and organizations. The risk management strategy is an important factor in establishing such policies and procedures. Policies and procedures contribute to security and privacy assurance. Therefore, it is important that security and privacy programs collaborate on the development of system and communications protection policy and procedures. Security and privacy program policies and procedures at the organization level are preferable, in general, and may obviate the need for mission- or system-specific policies and procedures. The policy can be included as part of the general security and privacy policy or be represented by multiple policies that reflect the complex nature of organizations. Procedures can be established for security and privacy programs, for mission or business processes, and for systems, if needed. Procedures describe how the policies or controls are implemented and can be directed at the individual or role that is the object of the procedure. Procedures can be documented in system security and privacy plans or in one or more separate documents. Events that may precipitate an update to system and communications protection policy and procedures include assessment or audit findings, security incidents or breaches, or changes in applicable laws, executive orders, directives, regulations, policies, standards, and guidelines. Simply restating controls does not constitute an organizational policy or procedure.",
    "group": "System and Communications Protection",
    "parent_id": "sc",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sc-5",
    "label": "SC-05",
    "title": "Denial-of-service Protection",
    "text": "Denial-of-service Protection\n{{ insert: param, sc-05_odp.02 }} the effects of the following types of denial-of-service events: {{ insert: param, sc-05_odp.01 }} ; and\nEmploy the following controls to achieve the denial-of-service objective: {{ insert: param, sc-05_odp.03 }}.\nDenial-of-service events may occur due to a variety of internal and external causes, such as an attack by an adversary or a lack of planning to support organizational needs with respect to capacity and bandwidth. Such attacks can occur across a wide range of network protocols (e.g., IPv4, IPv6). A variety of technologies are available to limit or eliminate the origination and effects of denial-of-service events. For example, boundary protection devices can filter certain types of packets to protect system components on internal networks from being directly affected by or the source of denial-of-service attacks. Employing increased network capacity and bandwidth combined with service redundancy also reduces the susceptibility to denial-of-service events.",
    "group": "System and Communications Protection",
    "parent_id": "sc",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sc-7",
    "label": "SC-07",
    "title": "Boundary Protection",
    "text": "Boundary Protection\nMonitor and control communications at the external managed interfaces to the system and at key internal managed interfaces within the system;\nImplement subnetworks for publicly accessible system components that are {{ insert: param, sc-07_odp }} separated from internal organizational networks; and\nConnect to external networks or systems only through managed interfaces consisting of boundary protection devices arranged in accordance with an organizational security and privacy architecture.\nManaged interfaces include gateways, routers, firewalls, guards, network-based malicious code analysis, virtualization systems, or encrypted tunnels implemented within a security architecture. Subnetworks that are physically or logically separated from internal networks are referred to as demilitarized zones or DMZs. Restricting or prohibiting interfaces within organizational systems includes restricting external web traffic to designated web servers within managed interfaces, prohibiting external traffic that appears to be spoofing internal addresses, and prohibiting internal traffic that appears to be spoofing external addresses. [SP 800-189](#f5edfe51-d1f2-422e-9b27-5d0e90b49c72) provides additional information on source address validation techniques to prevent ingress and egress of traffic with spoofed addresses. Commercial telecommunications services are provided by network components and consolidated management systems shared by customers. These services may also include third party-provided access lines and other service elements. Such services may represent sources of increased risk despite contract security provisions. Boundary protection may be implemented as a common control for all or part of an organizational network such that the boundary to be protected is greater than a system-specific boundary (i.e., an authorization boundary).",
    "group": "System and Communications Protection",
    "parent_id": "sc",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sc-8",
    "label": "SC-08",
    "title": "Transmission Confidentiality and Integrity",
    "text": "Transmission Confidentiality and Integrity\nProtect the {{ insert: param, sc-08_odp }} of transmitted information.\nProtecting the confidentiality and integrity of transmitted information applies to internal and external networks as well as any system components that can transmit information, including servers, notebook computers, desktop computers, mobile devices, printers, copiers, scanners, facsimile machines, and radios. Unprotected communication paths are exposed to the possibility of interception and modification. Protecting the confidentiality and integrity of information can be accomplished by physical or logical means. Physical protection can be achieved by using protected distribution systems. A protected distribution system is a wireline or fiber-optics telecommunications system that includes terminals and adequate electromagnetic, acoustical, electrical, and physical controls to permit its use for the unencrypted transmission of classified information. Logical protection can be achieved by employing encryption techniques.\n\nOrganizations that rely on commercial providers who offer transmission services as commodity services rather than as fully dedicated services may find it difficult to obtain the necessary assurances regarding the implementation of needed controls for transmission confidentiality and integrity. In such situations, organizations determine what types of confidentiality or integrity services are available in standard, commercial telecommunications service packages. If it is not feasible to obtain the necessary controls and assurances of control effectiveness through appropriate contracting vehicles, organizations can implement appropriate compensating controls.",
    "group": "System and Communications Protection",
    "parent_id": "sc",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sc-8.1",
    "label": "SC-08(01)",
    "title": "Cryptographic Protection",
    "text": "Cryptographic Protection\nImplement cryptographic mechanisms to {{ insert: param, sc-08.01_odp }} during transmission.\nEncryption protects information from unauthorized disclosure and modification during transmission. Cryptographic mechanisms that protect the confidentiality and integrity of information during transmission include TLS and IPSec. Cryptographic mechanisms used to protect information integrity include cryptographic hash functions that have applications in digital signatures, checksums, and message authentication codes.",
    "group": "System and Communications Protection",
    "parent_id": "sc-8",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sc-12",
    "label": "SC-12",
    "title": "Cryptographic Key Establishment and Management",
    "text": "Cryptographic Key Establishment and Management\nEstablish and manage cryptographic keys when cryptography is employed within the system in accordance with the following key management requirements: {{ insert: param, sc-12_odp }}.\nCryptographic key management and establishment can be performed using manual procedures or automated mechanisms with supporting manual procedures. Organizations define key management requirements in accordance with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines and specify appropriate options, parameters, and levels. Organizations manage trust stores to ensure that only approved trust anchors are part of such trust stores. This includes certificates with visibility external to organizational systems and certificates related to the internal operations of systems. [NIST CMVP](#1acdc775-aafb-4d11-9341-dc6a822e9d38) and [NIST CAVP](#84dc1b0c-acb7-4269-84c4-00dbabacd78c) provide additional information on validated cryptographic modules and algorithms that can be used in cryptographic key management and establishment.",
    "group": "System and Communications Protection",
    "parent_id": "sc",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sc-13",
    "label": "SC-13",
    "title": "Cryptographic Protection",
    "text": "Cryptographic Protection\nDetermine the {{ insert: param, sc-13_odp.01 }} ; and\nImplement the following types of cryptography required for each specified cryptographic use: {{ insert: param, sc-13_odp.02 }}.\nCryptography can be employed to support a variety of security solutions, including the protection of classified information and controlled unclassified information, the provision and implementation of digital signatures, and the enforcement of information separation when authorized individuals have the necessary clearances but lack the necessary formal access approvals. Cryptography can also be used to support random number and hash generation. Generally applicable cryptographic standards include FIPS-validated cryptography and NSA-approved cryptography. For example, organizations that need to protect classified information may specify the use of NSA-approved cryptography. Organizations that need to provision and implement digital signatures may specify the use of FIPS-validated cryptography. Cryptography is implemented in accordance with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines.",
    "group": "System and Communications Protection",
    "parent_id": "sc",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sc-15",
    "label": "SC-15",
    "title": "Collaborative Computing Devices and Applications",
    "text": "Collaborative Computing Devices and Applications\nProhibit remote activation of collaborative computing devices and applications with the following exceptions: {{ insert: param, sc-15_odp }} ; and\nProvide an explicit indication of use to users physically present at the devices.\nCollaborative computing devices and applications include remote meeting devices and applications, networked white boards, cameras, and microphones. The explicit indication of use includes signals to users when collaborative computing devices and applications are activated.",
    "group": "System and Communications Protection",
    "parent_id": "sc",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sc-20",
    "label": "SC-20",
    "title": "Secure Name/Address Resolution Service (Authoritative Source)",
    "text": "Secure Name/Address Resolution Service (Authoritative Source)\nProvide additional data origin authentication and integrity verification artifacts along with the authoritative name resolution data the system returns in response to external name/address resolution queries; and\nProvide the means to indicate the security status of child zones and (if the child supports secure resolution services) to enable verification of a chain of trust among parent and child domains, when operating as part of a distributed, hierarchical namespace.\nProviding authoritative source information enables external clients, including remote Internet clients, to obtain origin authentication and integrity verification assurances for the host/service name to network address resolution information obtained through the service. Systems that provide name and address resolution services include domain name system (DNS) servers. Additional artifacts include DNS Security Extensions (DNSSEC) digital signatures and cryptographic keys. Authoritative data includes DNS resource records. The means for indicating the security status of child zones include the use of delegation signer resource records in the DNS. Systems that use technologies other than the DNS to map between host and service names and network addresses provide other means to assure the authenticity and integrity of response data.",
    "group": "System and Communications Protection",
    "parent_id": "sc",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sc-21",
    "label": "SC-21",
    "title": "Secure Name/Address Resolution Service (Recursive or Caching Resolver)",
    "text": "Secure Name/Address Resolution Service (Recursive or Caching Resolver)\nRequest and perform data origin authentication and data integrity verification on the name/address resolution responses the system receives from authoritative sources.\nEach client of name resolution services either performs this validation on its own or has authenticated channels to trusted validation providers. Systems that provide name and address resolution services for local clients include recursive resolving or caching domain name system (DNS) servers. DNS client resolvers either perform validation of DNSSEC signatures, or clients use authenticated channels to recursive resolvers that perform such validations. Systems that use technologies other than the DNS to map between host and service names and network addresses provide some other means to enable clients to verify the authenticity and integrity of response data.",
    "group": "System and Communications Protection",
    "parent_id": "sc",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sc-22",
    "label": "SC-22",
    "title": "Architecture and Provisioning for Name/Address Resolution Service",
    "text": "Architecture and Provisioning for Name/Address Resolution Service\nEnsure the systems that collectively provide name/address resolution service for an organization are fault-tolerant and implement internal and external role separation.\nSystems that provide name and address resolution services include domain name system (DNS) servers. To eliminate single points of failure in systems and enhance redundancy, organizations employ at least two authoritative domain name system servers—one configured as the primary server and the other configured as the secondary server. Additionally, organizations typically deploy the servers in two geographically separated network subnetworks (i.e., not located in the same physical facility). For role separation, DNS servers with internal roles only process name and address resolution requests from within organizations (i.e., from internal clients). DNS servers with external roles only process name and address resolution information requests from clients external to organizations (i.e., on external networks, including the Internet). Organizations specify clients that can access authoritative DNS servers in certain roles (e.g., by address ranges and explicit lists).",
    "group": "System and Communications Protection",
    "parent_id": "sc",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sc-28",
    "label": "SC-28",
    "title": "Protection of Information at Rest",
    "text": "Protection of Information at Rest\nProtect the {{ insert: param, sc-28_odp.01 }} of the following information at rest: {{ insert: param, sc-28_odp.02 }}.\nInformation at rest refers to the state of information when it is not in process or in transit and is located on system components. Such components include internal or external hard disk drives, storage area network devices, or databases. However, the focus of protecting information at rest is not on the type of storage device or frequency of access but rather on the state of the information. Information at rest addresses the confidentiality and integrity of information and covers user information and system information. System-related information that requires protection includes configurations or rule sets for firewalls, intrusion detection and prevention systems, filtering routers, and authentication information. Organizations may employ different mechanisms to achieve confidentiality and integrity protections, including the use of cryptographic mechanisms and file share scanning. Integrity protection can be achieved, for example, by implementing write-once-read-many (WORM) technologies. When adequate protection of information at rest cannot otherwise be achieved, organizations may employ other controls, including frequent scanning to identify malicious code at rest and secure offline storage in lieu of online storage.",
    "group": "System and Communications Protection",
    "parent_id": "sc",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sc-28.1",
    "label": "SC-28(01)",
    "title": "Cryptographic Protection",
    "text": "Cryptographic Protection\nImplement cryptographic mechanisms to prevent unauthorized disclosure and modification of the following information at rest on {{ insert: param, sc-28.01_odp.02 }}: {{ insert: param, sc-28.01_odp.01 }}.\nThe selection of cryptographic mechanisms is based on the need to protect the confidentiality and integrity of organizational information. The strength of mechanism is commensurate with the security category or classification of the information. Organizations have the flexibility to encrypt information on system components or media or encrypt data structures, including files, records, or fields.",
    "group": "System and Communications Protection",
    "parent_id": "sc-28",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sc-39",
    "label": "SC-39",
    "title": "Process Isolation",
    "text": "Process Isolation\nMaintain a separate execution domain for each executing system process.\nSystems can maintain separate execution domains for each executing process by assigning each process a separate address space. Each system process has a distinct address space so that communication between processes is performed in a manner controlled through the security functions, and one process cannot modify the executing code of another process. Maintaining separate execution domains for executing processes can be achieved, for example, by implementing separate address spaces. Process isolation technologies, including sandboxing or virtualization, logically separate software and firmware from other software, firmware, and data. Process isolation helps limit the access of potentially untrusted software to other system resources. The capability to maintain separate execution domains is available in commercial operating systems that employ multi-state processor technologies.",
    "group": "System and Communications Protection",
    "parent_id": "sc",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "si-1",
    "label": "SI-01",
    "title": "Policy and Procedures",
    "text": "Policy and Procedures\nDevelop, document, and disseminate to {{ insert: param, si-1_prm_1 }}:\nDesignate an {{ insert: param, si-01_odp.04 }} to manage the development, documentation, and dissemination of the system and information integrity policy and procedures; and\nReview and update the current system and information integrity:\nSystem and information integrity policy and procedures address the controls in the SI family that are implemented within systems and organizations. The risk management strategy is an important factor in establishing such policies and procedures. Policies and procedures contribute to security and privacy assurance. Therefore, it is important that security and privacy programs collaborate on the development of system and information integrity policy and procedures. Security and privacy program policies and procedures at the organization level are preferable, in general, and may obviate the need for mission- or system-specific policies and procedures. The policy can be included as part of the general security and privacy policy or be represented by multiple policies that reflect the complex nature of organizations. Procedures can be established for security and privacy programs, for mission or business processes, and for systems, if needed. Procedures describe how the policies or controls are implemented and can be directed at the individual or role that is the object of the procedure. Procedures can be documented in system security and privacy plans or in one or more separate documents. Events that may precipitate an update to system and information integrity policy and procedures include assessment or audit findings, security incidents or breaches, or changes in applicable laws, executive orders, directives, regulations, policies, standards, and guidelines. Simply restating controls does not constitute an organizational policy or procedure.",
    "group": "System and Information Integrity",
    "parent_id": "si",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "si-2",
    "label": "SI-02",
    "title": "Flaw Remediation",
    "text": "Flaw Remediation\nIdentify, report, and correct system flaws;\nTest software and firmware updates related to flaw remediation for effectiveness and potential side effects before installation;\nInstall security-relevant software and firmware updates within {{ insert: param, si-02_odp }} of the release of the updates; and\nIncorporate flaw remediation into the organizational configuration management process.\nThe need to remediate system flaws applies to all types of software and firmware. Organizations identify systems affected by software flaws, including potential vulnerabilities resulting from those flaws, and report this information to designated organizational personnel with information security and privacy responsibilities. Security-relevant updates include patches, service packs, and malicious code signatures. Organizations also address flaws discovered during assessments, continuous monitoring, incident response activities, and system error handling. By incorporating flaw remediation into configuration management processes, required remediation actions can be tracked and verified.\n\nOrganization-defined time periods for updating security-relevant software and firmware may vary based on a variety of risk factors, including the security category of the system, the criticality of the update (i.e., severity of the vulnerability related to the discovered flaw), the organizational risk tolerance, the mission supported by the system, or the threat environment. Some types of flaw remediation may require more testing than other types. Organizations determine the type of testing needed for the specific type of flaw remediation activity under consideration and the types of changes that are to be configuration-managed. In some situations, organizations may determine that the testing of software or firmware updates is not necessary or practical, such as when implementing simple malicious code signature updates. In testing decisions, organizations consider whether security-relevant software or firmware updates are obtained from authorized sources with appropriate digital signatures.",
    "group": "System and Information Integrity",
    "parent_id": "si",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "si-3",
    "label": "SI-03",
    "title": "Malicious Code Protection",
    "text": "Malicious Code Protection\nImplement {{ insert: param, si-03_odp.01 }} malicious code protection mechanisms at system entry and exit points to detect and eradicate malicious code;\nAutomatically update malicious code protection mechanisms as new releases are available in accordance with organizational configuration management policy and procedures;\nConfigure malicious code protection mechanisms to:\nAddress the receipt of false positives during malicious code detection and eradication and the resulting potential impact on the availability of the system.\nSystem entry and exit points include firewalls, remote access servers, workstations, electronic mail servers, web servers, proxy servers, notebook computers, and mobile devices. Malicious code includes viruses, worms, Trojan horses, and spyware. Malicious code can also be encoded in various formats contained within compressed or hidden files or hidden in files using techniques such as steganography. Malicious code can be inserted into systems in a variety of ways, including by electronic mail, the world-wide web, and portable storage devices. Malicious code insertions occur through the exploitation of system vulnerabilities. A variety of technologies and methods exist to limit or eliminate the effects of malicious code.\n\nMalicious code protection mechanisms include both signature- and nonsignature-based technologies. Nonsignature-based detection mechanisms include artificial intelligence techniques that use heuristics to detect, analyze, and describe the characteristics or behavior of malicious code and to provide controls against such code for which signatures do not yet exist or for which existing signatures may not be effective. Malicious code for which active signatures do not yet exist or may be ineffective includes polymorphic malicious code (i.e., code that changes signatures when it replicates). Nonsignature-based mechanisms also include reputation-based technologies. In addition to the above technologies, pervasive configuration management, comprehensive software integrity controls, and anti-exploitation software may be effective in preventing the execution of unauthorized code. Malicious code may be present in commercial off-the-shelf software as well as custom-built software and could include logic bombs, backdoors, and other types of attacks that could affect organizational mission and business functions.\n\nIn situations where malicious code cannot be detected by detection methods or technologies, organizations rely on other types of controls, including secure coding practices, configuration management and control, trusted procurement processes, and monitoring practices to ensure that software does not perform functions other than the functions intended. Organizations may determine that, in response to the detection of malicious code, different actions may be warranted. For example, organizations can define actions in response to malicious code detection during periodic scans, the detection of malicious downloads, or the detection of maliciousness when attempting to open or execute files.",
    "group": "System and Information Integrity",
    "parent_id": "si",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "si-4",
    "label": "SI-04",
    "title": "System Monitoring",
    "text": "System Monitoring\nMonitor the system to detect:\nIdentify unauthorized use of the system through the following techniques and methods: {{ insert: param, si-04_odp.02 }};\nInvoke internal monitoring capabilities or deploy monitoring devices:\nAnalyze detected events and anomalies;\nAdjust the level of system monitoring activity when there is a change in risk to organizational operations and assets, individuals, other organizations, or the Nation;\nObtain legal opinion regarding system monitoring activities; and\nProvide {{ insert: param, si-04_odp.03 }} to {{ insert: param, si-04_odp.04 }} {{ insert: param, si-04_odp.05 }}.\nSystem monitoring includes external and internal monitoring. External monitoring includes the observation of events occurring at external interfaces to the system. Internal monitoring includes the observation of events occurring within the system. Organizations monitor systems by observing audit activities in real time or by observing other system aspects such as access patterns, characteristics of access, and other actions. The monitoring objectives guide and inform the determination of the events. System monitoring capabilities are achieved through a variety of tools and techniques, including intrusion detection and prevention systems, malicious code protection software, scanning tools, audit record monitoring software, and network monitoring software.\n\nDepending on the security architecture, the distribution and configuration of monitoring devices may impact throughput at key internal and external boundaries as well as at other locations across a network due to the introduction of network throughput latency. If throughput management is needed, such devices are strategically located and deployed as part of an established organization-wide security architecture. Strategic locations for monitoring devices include selected perimeter locations and near key servers and server farms that support critical applications. Monitoring devices are typically employed at the managed interfaces associated with controls [SC-7](#sc-7) and [AC-17](#ac-17) . The information collected is a function of the organizational monitoring objectives and the capability of systems to support such objectives. Specific types of transactions of interest include Hypertext Transfer Protocol (HTTP) traffic that bypasses HTTP proxies. System monitoring is an integral part of organizational continuous monitoring and incident response programs, and output from system monitoring serves as input to those programs. System monitoring requirements, including the need for specific types of system monitoring, may be referenced in other controls (e.g., [AC-2g](#ac-2_smt.g), [AC-2(7)](#ac-2.7), [AC-2(12)(a)](#ac-2.12_smt.a), [AC-17(1)](#ac-17.1), [AU-13](#au-13), [AU-13(1)](#au-13.1), [AU-13(2)](#au-13.2), [CM-3f](#cm-3_smt.f), [CM-6d](#cm-6_smt.d), [MA-3a](#ma-3_smt.a), [MA-4a](#ma-4_smt.a), [SC-5(3)(b)](#sc-5.3_smt.b), [SC-7a](#sc-7_smt.a), [SC-7(24)(b)](#sc-7.24_smt.b), [SC-18b](#sc-18_smt.b), [SC-43b](#sc-43_smt.b) ). Adjustments to levels of system monitoring are based on law enforcement information, intelligence information, or other sources of information. The legality of system monitoring activities is based on applicable laws, executive orders, directives, regulations, policies, standards, and guidelines.",
    "group": "System and Information Integrity",
    "parent_id": "si",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "si-5",
    "label": "SI-05",
    "title": "Security Alerts, Advisories, and Directives",
    "text": "Security Alerts, Advisories, and Directives\nReceive system security alerts, advisories, and directives from {{ insert: param, si-05_odp.01 }} on an ongoing basis;\nGenerate internal security alerts, advisories, and directives as deemed necessary;\nDisseminate security alerts, advisories, and directives to: {{ insert: param, si-05_odp.02 }} ; and\nImplement security directives in accordance with established time frames, or notify the issuing organization of the degree of noncompliance.\nThe Cybersecurity and Infrastructure Security Agency (CISA) generates security alerts and advisories to maintain situational awareness throughout the Federal Government. Security directives are issued by OMB or other designated organizations with the responsibility and authority to issue such directives. Compliance with security directives is essential due to the critical nature of many of these directives and the potential (immediate) adverse effects on organizational operations and assets, individuals, other organizations, and the Nation should the directives not be implemented in a timely manner. External organizations include supply chain partners, external mission or business partners, external service providers, and other peer or supporting organizations.",
    "group": "System and Information Integrity",
    "parent_id": "si",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "si-12",
    "label": "SI-12",
    "title": "Information Management and Retention",
    "text": "Information Management and Retention\nManage and retain information within the system and information output from the system in accordance with applicable laws, executive orders, directives, regulations, policies, standards, guidelines and operational requirements.\nInformation management and retention requirements cover the full life cycle of information, in some cases extending beyond system disposal. Information to be retained may also include policies, procedures, plans, reports, data output from control implementation, and other types of administrative information. The National Archives and Records Administration (NARA) provides federal policy and guidance on records retention and schedules. If organizations have a records management office, consider coordinating with records management personnel. Records produced from the output of implemented controls that may require management and retention include, but are not limited to: All XX-1, [AC-6(9)](#ac-6.9), [AT-4](#at-4), [AU-12](#au-12), [CA-2](#ca-2), [CA-3](#ca-3), [CA-5](#ca-5), [CA-6](#ca-6), [CA-7](#ca-7), [CA-8](#ca-8), [CA-9](#ca-9), [CM-2](#cm-2), [CM-3](#cm-3), [CM-4](#cm-4), [CM-6](#cm-6), [CM-8](#cm-8), [CM-9](#cm-9), [CM-12](#cm-12), [CM-13](#cm-13), [CP-2](#cp-2), [IR-6](#ir-6), [IR-8](#ir-8), [MA-2](#ma-2), [MA-4](#ma-4), [PE-2](#pe-2), [PE-8](#pe-8), [PE-16](#pe-16), [PE-17](#pe-17), [PL-2](#pl-2), [PL-4](#pl-4), [PL-7](#pl-7), [PL-8](#pl-8), [PM-5](#pm-5), [PM-8](#pm-8), [PM-9](#pm-9), [PM-18](#pm-18), [PM-21](#pm-21), [PM-27](#pm-27), [PM-28](#pm-28), [PM-30](#pm-30), [PM-31](#pm-31), [PS-2](#ps-2), [PS-6](#ps-6), [PS-7](#ps-7), [PT-2](#pt-2), [PT-3](#pt-3), [PT-7](#pt-7), [RA-2](#ra-2), [RA-3](#ra-3), [RA-5](#ra-5), [RA-8](#ra-8), [SA-4](#sa-4), [SA-5](#sa-5), [SA-8](#sa-8), [SA-10](#sa-10), [SI-4](#si-4), [SR-2](#sr-2), [SR-4](#sr-4), [SR-8](#sr-8).",
    "group": "System and Information Integrity",
    "parent_id": "si",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sr-1",
    "label": "SR-01",
    "title": "Policy and Procedures",
    "text": "Policy and Procedures\nDevelop, document, and disseminate to {{ insert: param, sr-1_prm_1 }}:\nDesignate an {{ insert: param, sr-01_odp.04 }} to manage the development, documentation, and dissemination of the supply chain risk management policy and procedures; and\nReview and update the current supply chain risk management:\nSupply chain risk management policy and procedures address the controls in the SR family as well as supply chain-related controls in other families that are implemented within systems and organizations. The risk management strategy is an important factor in establishing such policies and procedures. Policies and procedures contribute to security and privacy assurance. Therefore, it is important that security and privacy programs collaborate on the development of supply chain risk management policy and procedures. Security and privacy program policies and procedures at the organization level are preferable, in general, and may obviate the need for mission- or system-specific policies and procedures. The policy can be included as part of the general security and privacy policy or be represented by multiple policies that reflect the complex nature of organizations. Procedures can be established for security and privacy programs, for mission or business processes, and for systems, if needed. Procedures describe how the policies or controls are implemented and can be directed at the individual or role that is the object of the procedure. Procedures can be documented in system security and privacy plans or in one or more separate documents. Events that may precipitate an update to supply chain risk management policy and procedures include assessment or audit findings, security incidents or breaches, or changes in applicable laws, executive orders, directives, regulations, policies, standards, and guidelines. Simply restating controls does not constitute an organizational policy or procedure.",
    "group": "Supply Chain Risk Management",
    "parent_id": "sr",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sr-2",
    "label": "SR-02",
    "title": "Supply Chain Risk Management Plan",
    "text": "Supply Chain Risk Management Plan\nDevelop a plan for managing supply chain risks associated with the research and development, design, manufacturing, acquisition, delivery, integration, operations and maintenance, and disposal of the following systems, system components or system services: {{ insert: param, sr-02_odp.01 }};\nReview and update the supply chain risk management plan {{ insert: param, sr-02_odp.02 }} or as required, to address threat, organizational or environmental changes; and\nProtect the supply chain risk management plan from unauthorized disclosure and modification.\nThe dependence on products, systems, and services from external providers, as well as the nature of the relationships with those providers, present an increasing level of risk to an organization. Threat actions that may increase security or privacy risks include unauthorized production, the insertion or use of counterfeits, tampering, theft, insertion of malicious software and hardware, and poor manufacturing and development practices in the supply chain. Supply chain risks can be endemic or systemic within a system element or component, a system, an organization, a sector, or the Nation. Managing supply chain risk is a complex, multifaceted undertaking that requires a coordinated effort across an organization to build trust relationships and communicate with internal and external stakeholders. Supply chain risk management (SCRM) activities include identifying and assessing risks, determining appropriate risk response actions, developing SCRM plans to document response actions, and monitoring performance against plans. The SCRM plan (at the system-level) is implementation specific, providing policy implementation, requirements, constraints and implications. It can either be stand-alone, or incorporated into system security and privacy plans. The SCRM plan addresses managing, implementation, and monitoring of SCRM controls and the development/sustainment of systems across the SDLC to support mission and business functions.\n\nBecause supply chains can differ significantly across and within organizations, SCRM plans are tailored to the individual program, organizational, and operational contexts. Tailored SCRM plans provide the basis for determining whether a technology, service, system component, or system is fit for purpose, and as such, the controls need to be tailored accordingly. Tailored SCRM plans help organizations focus their resources on the most critical mission and business functions based on mission and business requirements and their risk environment. Supply chain risk management plans include an expression of the supply chain risk tolerance for the organization, acceptable supply chain risk mitigation strategies or controls, a process for consistently evaluating and monitoring supply chain risk, approaches for implementing and communicating the plan, a description of and justification for supply chain risk mitigation measures taken, and associated roles and responsibilities. Finally, supply chain risk management plans address requirements for developing trustworthy, secure, privacy-protective, and resilient system components and systems, including the application of the security design principles implemented as part of life cycle-based systems security engineering processes (see [SA-8](#sa-8)).",
    "group": "Supply Chain Risk Management",
    "parent_id": "sr",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sr-2.1",
    "label": "SR-02(01)",
    "title": "Establish SCRM Team",
    "text": "Establish SCRM Team\nEstablish a supply chain risk management team consisting of {{ insert: param, sr-02.01_odp.01 }} to lead and support the following SCRM activities: {{ insert: param, sr-02.01_odp.02 }}.\nTo implement supply chain risk management plans, organizations establish a coordinated, team-based approach to identify and assess supply chain risks and manage these risks by using programmatic and technical mitigation techniques. The team approach enables organizations to conduct an analysis of their supply chain, communicate with internal and external partners or stakeholders, and gain broad consensus regarding the appropriate resources for SCRM. The SCRM team consists of organizational personnel with diverse roles and responsibilities for leading and supporting SCRM activities, including risk executive, information technology, contracting, information security, privacy, mission or business, legal, supply chain and logistics, acquisition, business continuity, and other relevant functions. Members of the SCRM team are involved in various aspects of the SDLC and, collectively, have an awareness of and provide expertise in acquisition processes, legal practices, vulnerabilities, threats, and attack vectors, as well as an understanding of the technical aspects and dependencies of systems. The SCRM team can be an extension of the security and privacy risk management processes or be included as part of an organizational risk management team.",
    "group": "Supply Chain Risk Management",
    "parent_id": "sr-2",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sr-3",
    "label": "SR-03",
    "title": "Supply Chain Controls and Processes",
    "text": "Supply Chain Controls and Processes\nEstablish a process or processes to identify and address weaknesses or deficiencies in the supply chain elements and processes of {{ insert: param, sr-03_odp.01 }} in coordination with {{ insert: param, sr-03_odp.02 }};\nEmploy the following controls to protect against supply chain risks to the system, system component, or system service and to limit the harm or consequences from supply chain-related events: {{ insert: param, sr-03_odp.03 }} ; and\nDocument the selected and implemented supply chain processes and controls in {{ insert: param, sr-03_odp.04 }}.\nSupply chain elements include organizations, entities, or tools employed for the research and development, design, manufacturing, acquisition, delivery, integration, operations and maintenance, and disposal of systems and system components. Supply chain processes include hardware, software, and firmware development processes; shipping and handling procedures; personnel security and physical security programs; configuration management tools, techniques, and measures to maintain provenance; or other programs, processes, or procedures associated with the development, acquisition, maintenance and disposal of systems and system components. Supply chain elements and processes may be provided by organizations, system integrators, or external providers. Weaknesses or deficiencies in supply chain elements or processes represent potential vulnerabilities that can be exploited by adversaries to cause harm to the organization and affect its ability to carry out its core missions or business functions. Supply chain personnel are individuals with roles and responsibilities in the supply chain.",
    "group": "Supply Chain Risk Management",
    "parent_id": "sr",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sr-5",
    "label": "SR-05",
    "title": "Acquisition Strategies, Tools, and Methods",
    "text": "Acquisition Strategies, Tools, and Methods\nEmploy the following acquisition strategies, contract tools, and procurement methods to protect against, identify, and mitigate supply chain risks: {{ insert: param, sr-05_odp }}.\nThe use of the acquisition process provides an important vehicle to protect the supply chain. There are many useful tools and techniques available, including obscuring the end use of a system or system component, using blind or filtered buys, requiring tamper-evident packaging, or using trusted or controlled distribution. The results from a supply chain risk assessment can guide and inform the strategies, tools, and methods that are most applicable to the situation. Tools and techniques may provide protections against unauthorized production, theft, tampering, insertion of counterfeits, insertion of malicious software or backdoors, and poor development practices throughout the system development life cycle. Organizations also consider providing incentives for suppliers who implement controls, promote transparency into their processes and security and privacy practices, provide contract language that addresses the prohibition of tainted or counterfeit components, and restrict purchases from untrustworthy suppliers. Organizations consider providing training, education, and awareness programs for personnel regarding supply chain risk, available mitigation strategies, and when the programs should be employed. Methods for reviewing and protecting development plans, documentation, and evidence are commensurate with the security and privacy requirements of the organization. Contracts may specify documentation protection requirements.",
    "group": "Supply Chain Risk Management",
    "parent_id": "sr",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sr-8",
    "label": "SR-08",
    "title": "Notification Agreements",
    "text": "Notification Agreements\nEstablish agreements and procedures with entities involved in the supply chain for the system, system component, or system service for the {{ insert: param, sr-08_odp.01 }}.\nThe establishment of agreements and procedures facilitates communications among supply chain entities. Early notification of compromises and potential compromises in the supply chain that can potentially adversely affect or have adversely affected organizational systems or system components is essential for organizations to effectively respond to such incidents. The results of assessments or audits may include open-source information that contributed to a decision or result and could be used to help the supply chain entity resolve a concern or improve its processes.",
    "group": "Supply Chain Risk Management",
    "parent_id": "sr",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sr-10",
    "label": "SR-10",
    "title": "Inspection of Systems or Components",
    "text": "Inspection of Systems or Components\nInspect the following systems or system components {{ insert: param, sr-10_odp.02 }} to detect tampering: {{ insert: param, sr-10_odp.01 }}.\nThe inspection of systems or systems components for tamper resistance and detection addresses physical and logical tampering and is applied to systems and system components removed from organization-controlled areas. Indications of a need for inspection include changes in packaging, specifications, factory location, or entity in which the part is purchased, and when individuals return from travel to high-risk locations.",
    "group": "Supply Chain Risk Management",
    "parent_id": "sr",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sr-11",
    "label": "SR-11",
    "title": "Component Authenticity",
    "text": "Component Authenticity\nDevelop and implement anti-counterfeit policy and procedures that include the means to detect and prevent counterfeit components from entering the system; and\nReport counterfeit system components to {{ insert: param, sr-11_odp.01 }}.\nSources of counterfeit components include manufacturers, developers, vendors, and contractors. Anti-counterfeiting policies and procedures support tamper resistance and provide a level of protection against the introduction of malicious code. External reporting organizations include CISA.",
    "group": "Supply Chain Risk Management",
    "parent_id": "sr",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sr-11.1",
    "label": "SR-11(01)",
    "title": "Anti-counterfeit Training",
    "text": "Anti-counterfeit Training\nTrain {{ insert: param, sr-11.01_odp }} to detect counterfeit system components (including hardware, software, and firmware).\nNone.",
    "group": "Supply Chain Risk Management",
    "parent_id": "sr-11",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sr-11.2",
    "label": "SR-11(02)",
    "title": "Configuration Control for Component Service and Repair",
    "text": "Configuration Control for Component Service and Repair\nMaintain configuration control over the following system components awaiting service or repair and serviced or repaired components awaiting return to service: {{ insert: param, sr-11.02_odp }}.\nNone.",
    "group": "Supply Chain Risk Management",
    "parent_id": "sr-11",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  },
  {
    "id": "sr-12",
    "label": "SR-12",
    "title": "Component Disposal",
    "text": "Component Disposal\nDispose of {{ insert: param, sr-12_odp.01 }} using the following techniques and methods: {{ insert: param, sr-12_odp.02 }}.\nData, documentation, tools, or system components can be disposed of at any time during the system development life cycle (not only in the disposal or retirement phase of the life cycle). For example, disposal can occur during research and development, design, prototyping, or operations/maintenance and include methods such as disk cleaning, removal of cryptographic keys, partial reuse of components. Opportunities for compromise during disposal affect physical and logical data, including system documentation in paper-based or digital files; shipping and delivery documentation; memory sticks with software code; or complete routers or servers that include permanent media, which contain sensitive or proprietary information. Additionally, proper disposal of system components helps to prevent such components from entering the gray market.",
    "group": "Supply Chain Risk Management",
    "parent_id": "sr",
    "framework": "fedramp_low",
    "baseline": "low",
    "source": "FedRAMP Rev5"
  }
]